[{"title": "100 Poems to Lift Your Spirits", "isbn": "0446177954", "averageRating": "3.89", "description": "No matter what the occasion, this collection of poems is the perfect gift to cheer up a friend or family member. Here, in this compact volume, are 100 poems written by the world's greatest poets, some inspiring, some hilarious, and all memorable. Each delightful poem is preceded by an illuminating headnote. Among the poems included are classics, such as Schiller's \"Ode to Joy,\" Wordsworth's \"My Heart Leaps Up,\" Longfellow's \"A Psalm of Life,\" and Dickinson's \"'Hope is the Thing with Feathers.\" This collection includes many more captivating works that take as their exhilarating theme the limitless possibilities of human existence. Whether it's through inspired nonsense or insightful commentary, these poems will leave readers feeling happier and enriched for having read them.", "author": "Leslie Pockell"}, {"title": "A Game of Thrones: The Graphic Novel, Vol. 4", "isbn": "0345529197", "averageRating": "4.09", "description": "Bestselling writer Daniel Abraham and acclaimed illustrator Tommy Patterson bring their stunning graphic-novel adaptation of George R. R. Martin's classic A Game of Thronesto a stunning finish that merits a place alongside the majestic original on the bookshelf of every fantasy fan.\nThe death of King Robert Baratheon and the imprisonment of his Hand, Lord Eddard Stark of Winterfell, has set the great houses of Westeros at one another's throats.\nIn Winterfell, Eddard's eldest son and heir, Robb Stark, has gathered an army and is pushing south, determined to free his father. Along the way, he pledges to marry the daughter of Lord Walder Frey in exchange for a military advantage that allows him to capture Jaime Lannister--a powerful bargaining chip to ensure Lord Eddard's safe release. But it is one thing to capture the Kingslayer and quite another to hold him.\nMeanwhile, in King's Landing, young King Joffrey has other ideas than an exchange of prisoners. Ignoring the advice of his mother, Queen Cersei, he throws oil on the flames of conflict and ignites a conflagration that seems likely to consume not only the Starks but all of Westeros--unless Tyrion Lannister, the Imp, can bring the mad boy-king to heel.\nBeyond the Wall, greater dangers are brewing, as a winter as brutal as any in history approaches, bringing with it unnatural creatures out of legend. There, Eddard's bastard, Jon Snow, must decide once and for all where his loyalties lie.\nAnd across the Narrow Sea, Daenerys Targaryen will learn the true measure of grief--and emerge from its fiery depths transformed, hardened, and ready to claim what is hers by right: the Iron Throne.", "author": "Daniel Abraham"}, {"title": "A Kitty in the Lion's Den (Sweet Water, #3)", "isbn": "", "averageRating": "3.79", "description": "Maverick's story.", "author": "Jenika Snow"}, {"title": "A Monster Calls", "isbn": "1406346950", "averageRating": "4.37", "description": "An unflinching, darkly funny, and deeply moving story of a boy, his seriously ill mother, and an unexpected monstrous visitor.\nAt seven minutes past midnight, thirteen-year-old Conor wakes to find a monster outside his bedroom window. But it isn't the monster Conor's been expecting-- he's been expecting the one from his nightmare, the nightmare he's had nearly every night since his mother started her treatments. The monster in his backyard is different. It's ancient. And wild. And it wants something from Conor. Something terrible and dangerous. It wants the truth. From the final idea of award-winning author Siobhan Dowd-- whose premature death from cancer prevented her from writing it herself-- Patrick Ness has spun a haunting and darkly funny novel of mischief, loss, and monsters both real and imagined.", "author": "Patrick Ness"}, {"title": "A Murder is Announced", "isbn": "0062265806", "averageRating": "3.96", "description": "Agatha Christie's most ingenious murder mystery, reissued with a striking new cover designed to appeal to the latest generation of Agatha Christie fans and book lovers.\nThe villagers of Chipping Cleghorn, including Jane Marple, are agog with curiosity over an advertisement in the local gazette which reads: 'A murder is announced and will take place on Friday October 29th, at Little Paddocks at 6.30 p.m.'\nA childish practical joke? Or a hoax intended to scare poor Letitia Blacklock? Unable to resist the mysterious invitation, a crowd begins to gather at Little Paddocks at the appointed time when, without warning, the lights go out...", "author": "Agatha Christie"}, {"title": "Alice's adventures in Wonderland ; and, Through the looking-glass", "isbn": "0906320941", "averageRating": "4.06", "description": "By falling down a rabbit hole and stepping through a mirror, Alice experiences unusual adventures with a variety of nonsensical characters.", "author": "Lewis Carroll"}, {"title": "All's Fairy in Love and War (Avalon: Web of Magic, #8)", "isbn": "1934876569", "averageRating": "4.22", "description": "To Kara's astonishment, she discovers that a portal has opened in her bedroom closet and two goblins have fallen through! They refuse to return to the fairy realms and be drafted for an impending war. In an attempt to roust the pesky creatures, Kara falls through the portal, smack into the middle of a huge war. Kara meets Queen Selinda, who appoints Kara as a Fairy Princess and assigns her an impossible task: to put an end to the war using her diplomatic skills.\nAll's Fairy In Love And War is the eighth book in Avalon: Web of Magic, a twelve-book fantasy series for middle grade readers. Through their magical journey, the teenage heroines discover who they really are . . . and run into plenty of good guys, bad guys, and cute guys. Out of print for two years, Seven Seas is pleased to return the Avalon series to print in editions targeted for today's readers, with new manga-style covers and interior illustrations.", "author": "Rachel Roberts"}, {"title": "Amadi's Snowman: A Story of Reading", "isbn": "0884482987", "averageRating": "3.89", "description": "When Amadi disobeys his mother and runs off to the market instead of sticking around for a reading lesson, he encounters a much-admired older boy secretly reading at a book stall. Crowding himself in among the stacks of books, Amadi becomes intrigued by a storybook with pictures of a strange white creature with a carrot for a nose. Over the course of a typical mischievous day, unable to shake his questions about the snowman, Amadi discovers the vast world reading could open up--especially for an Igbo man of Nigeria.", "author": "Katia Novet Saint-Lot"}, {"title": "An Accidental Murder (A Yellow Cottage Vintage Mystery, #1)", "isbn": "", "averageRating": "3.91", "description": "An alternate cover edition exists \u0001.\nYoung widow, Isobella Bridges discovered and fell in love with The Yellow Cottage as a child. Many years later she returned to the Island, discovered it was for sale and bought it on a whim. Or so she thought.\nShe had no idea at the time how much it would change her life, nor that it was yet to reveal all it's secrets. Ones that even Ella couldn't imagine.\nShe purchased the cottage from an old lady, but this was no ordinary old lady. And she left her cat, but this was no ordinary cat.\nElla soon realises that this isn't the only gift the old lady left.\nHaving only been in residence a few short weeks, and still unpacking boxes, she receives a telephone call from her brother, inviting her up to London for Sunday lunch.\nThis call sets in motion a series of events that puts Ella's life, and those of the people closest to her in danger.\n'An Accidental Murder' is a cosy amateur sleuth novella, with a difference. Set in 1930's England, it is the first in the series of The Yellow Cottage mysteries.\n*Please note this is a novella of around 25,000 words.*", "author": "J. New"}, {"title": "Ants on the Melon: a Collection of Poems", "isbn": "0679448810", "averageRating": "4.02", "description": "Already singled out by The New York Times and the subject of a feature in The New Yorker, Virginia Adair has, after decades of shunning book publication, decided to collect eighty of her best poems in a volume that will surely be hailed as among the most accomplished works of our time.\nAnts on the Melon includes poems that concern the author's childhood, that explore sensuality in candid terms, that starkly treat her husband's suicide and her own blindness, and that explore both her own emotional landscape and the universal mysteries of the human condition. Technically brilliant, using strict, classical prosody, yet entirely modern in sensibility, Virginia Adair's poetry will play a central role in the ongoing American poetry renaissance.", "author": "Virginia Adair"}, {"title": "Baptism of Fire", "isbn": "0316219169", "averageRating": "4.36", "description": "The Wizards Guild has been shattered by a coup and, in the uproar, Geralt was seriously injured. The Witcher is supposed to be a guardian of the innocent, a protector of those in need, a defender against powerful and dangerous monsters that prey on men in dark times.\nBut now that dark times have fallen upon the world, Geralt is helpless until he has recovered from his injuries.\nWhile war rages across all of the lands, the future of magic is under threat and those sorcerers who survive are determined to protect it. It's an impossible situation in which to find one girl - Ciri, the heiress to the throne of Cintra, has vanished - until a rumor places her in the Niflgaard court, preparing to marry the Emperor.\nInjured or not, Geralt has a rescue mission on his hands.\nThis is the third of the Witcher novels by Andrzej Sapkowski.", "author": "Andrzej Sapkowski"}, {"title": "Beacon of Love (Hometown Heroes, #1)", "isbn": "1616504560", "averageRating": "3.99", "description": "Welcome to Lindsey Point: home of a haunted lighthouse, a 50-year old murder mystery, and a romance about to erupt between travel journalist Sophie Smithwaite and hunky local handyman Lucas Oakes. He wants to protect the town's secrets. She's bent on uncovering them at all costs. As the mystery deepens, sparks fly and legends crumble. Is preserving tradition worth giving up a chance at true love?\n\"Beacon of Love has likable characters, lively dialogue and a local mystery which needs to be solved. Well paced with just the right amount of humor, I found myself turning the pages to see just what was going to happen next...the scenes between Sophie and Lucas are fun, light and full of sexual tension...\" ~Queen of the Night Reviews\n\"I really enjoyed the premises of this story. True love...Secrets....New Love....Wonderful!\" ~4-Stars on Goodreads\n\"Beacon of Love by Allie Boniface was the perfect slice of heaven for me! Not only did we get a nice romance, but we also got to dig into an old mystery and try to solve a 50 year-old murder...\" ~Romance Addict Book Blog\n*Note: this book was originally published in 2013 by Lyrical Press,", "author": "Allie Boniface"}, {"title": "Blackout in the Garden of Love (Love Blooms Series Vol#1)", "isbn": "", "averageRating": "4.00", "description": "John Vincent and Amerise Carlton are ready to strangle their mutual friend, Ellen, when she pairs them on a blind date certain to be a recipe for disaster. What should have been a fun-filled evening turns sour when the mismatched couple butts heads over dinner. Toss in an inept waiter, the hottest day of the year, a city-wide blackout, and the date goes from bad to worse. Just when rock bottom looms near, the unlikely couple is given a new perspective.\nA moonlit garden, novelty candy, and a sweet summer night open the doorway to understanding. Can this unlikely couple find the sugary spark of romance in a city engulfed by darkness?\nMaybe Ellen was on to something after all!\nLove Blooms is a new series of sweet interracial romance shorts and novellas. Showcasing what I've chosen to tag as 'Vibrant Interracial Romance'.\nWhat do I mean by 'vibrant interracial' romance? I want my stories and characters to resonate -- to set off an empathetic vibration in my readers because life has taken them into some of the same valleys and has them hoping to reach the same mountain tops.\nI love my characters, and I don't want to say their emotions are my playground, but I do believe I can bring out through them -- feelings, life experiences, joy and pain that most anyone can relate to. I don't put them through all their struggles just to create drama-- they're headed somewhere. On their way to discover real connection to another person, a true soul mate. The good and bad they've lived through before they get to that glorious place are the seeds planted so that Love may bloom.\nBLACKOUT IN THE GARDEN OF LOVE is Vol#1 of the LOVE BLOOM SERIES.\nStop by my blog http://venicekennedy.wordpress.com/to hear more about my LOVE BLOOMS SERIES, my journey to indie publishing or chat about everything sweet IR!", "author": "Venice Kennedy"}, {"title": "Bonfire (Hours of the Night #1.5)", "isbn": "", "averageRating": "4.18", "description": "Silent night, holy hell.\nThaddeus and Sarasija are spending the holidays on the bayou, and while the vampire's idea of Christmas cheer doesn't quite match his assistant's, they're working on a compromise. Before they can get the tree trimmed, they're interrupted by the appearance of the feu follet. The ghostly lights appear in the swamp at random and lead even the locals astray.\nWhen the townsfolk link the phenomenon to the return of their most reclusive neighbor, suspicion falls on Thaddeus. These lights aren't bringing glad tidings, and if Thad and Sara can't find their source, the feu follet might herald a holiday tragedy for the whole town.\nThis holiday novella can be enjoyed alone or as book 1.5 of the Hours of the Night Series. Bonfire takes place the December after the events in Vespers.", "author": "Irene Preston"}, {"title": "Bounty Hunter 4/3: My Life in Combat from Marine Scout Sniper to MARSOC", "isbn": "", "averageRating": "4.05", "description": "The fight for Jason Delgado's life and soul began when he was just a boy. He ultimately escaped the death and drugs of a crime-riddled Bronx by way of the United States Marine Corps. However, after earning his way into the esteemed ranks of the service's famed Scout Snipers, Delgado saw that old struggle reignited when he was dumped into the hell of war in Iraq.\nThere Delgado proved not only a participant, but a warrior capable of turning the tide in several of the most harrowing and historically important battles of the evolving war. He took all the hard lessons learned in combat and, as MARSOC's original lead sniper instructor, made himself a pivotal figure in revolutionizing the way special operations snipers trained and operated. But even after accomplishing his mission in the military, Delgado still faced that original fight, struggling to understand and accept the man his experiences had transformed him into.", "author": "Jason Delgado"}, {"title": "CARRIE'S MAIL ORDER HUSBAND", "isbn": "", "averageRating": "3.95", "description": "Very short story", "author": "Cia Leah"}, {"title": "Captain America: Winter Soldier (The Ultimate Graphic Novels Collection: Publication Order, #7)", "isbn": "", "averageRating": "4.28", "description": "The questions plaguing Captain America's dreams and memories have been answered in the most brutal way possible. And in the wake of this brutality, General Lukin makes his first all-out assault - tearing open old wounds and threatening to make new scars that will never heal!", "author": "Ed Brubaker"}, {"title": "Circles of Hell", "isbn": "0141980222", "averageRating": "3.29", "description": "'I truly thought I'd never make it back.'\nTen of the most memorable and most terrifying cantos from Dante's Inferno.\nIntroducing Little Black Classics: 80 books for Penguin's 80th birthday. Little Black Classics celebrate the huge range and diversity of Penguin Classics, with books from around the world and across many centuries. They take us from a balloon ride over Victorian London to a garden of blossom in Japan, from Tierra del Fuego to 16th-century California and the Russian steppe. Here are stories lyrical and savage; poems epic and intimate; essays satirical and inspirational; and ideas that have shaped the lives of millions.\nDante Alighieri (1265-1321).\nDante's works available in Penguin Classics are Inferno, Purgatorio, Paradiso, The Divine Comedy and Vita Nuova.", "author": "Dante Alighieri"}, {"title": "Combat and Other Shenanigans", "isbn": "", "averageRating": "3.87", "description": "War is hell...but sometimes it's also funny as hell. Combat and Other Shenanigansis Lieutenant Piers Platt's firsthand account of his year as a cavalry platoon leader in Iraq. Wry, action-packed, and poignant, Combat and Other Shenanigansis the absurd-but-true story of the antics the world's finest soldiers get up to when no one high-ranking is watching.", "author": "Piers Platt"}, {"title": "Crossed + One Hundred, Volume 2 (Crossed +100 #2)", "isbn": "1592912753", "averageRating": "3.51", "description": "Alan Moore s redefining of the Crossed universe 100 years in the future continues with his hand selected successor, Crossed: Wish You Were Here scribe, Simon Spurrier. Future s world was devastated by the realization that one of her closest friends was actually the ultimate Trojan horse and led to the devastation of Chooga. Now as she helps a new town of survivors prepare for the organized attack of the evolved Crossed, she realizes that her best efforts may not be enough. The Crossed have a plan and they are coming. No amount of wishful fiction will prevent the conflict to come.\nThis masterwork is a self-contained whole new world; no prior knowledge of the Crossed series is needed. Crossed +100 Vol 2 TP contains the continuing story originally presented in issues #7 - 12 of the ongoing comic book series.\n\"", "author": "Simon Spurrier"}, {"title": "Crossed, Volume 15", "isbn": "1592912737", "averageRating": "3.16", "description": "Comics horror veteran Mike Wolfer writes and illustrates a powerful new chapter in the Crossed saga! After admitting two women into their defensible stronghold atop a collapsed bridge, an uneasy alliance of survivors discovers just how the women successfully navigated through the horrors on the ground below. They followed the advice of their -bible, - a best-selling, -zombie survival guide- novel. Fiction or not, the book could be the answer to saving all of their lives in the wasteland ruled by the maniacal Crossed. But trust in the uninfected can be more dangerous than the violent urges of the Crossed themselves. There is no help, there is no hope. There is only the Crossed. This volume collects issues #81 - 86 of the ongoing Crossed: Badlands series.", "author": "Mike Wolfer"}, {"title": "Crowner Royal (Crowner John Mystery, #13)", "isbn": "184737297X", "averageRating": "3.93", "description": "London, 1196. At the command of Richard the Lionheart, Sir John de Wolfe has left his beloved West Country for the Palace of Westminster, where he has been appointed Coroner of the Verge. But with the king overseas, embroiled in a costly war against King Philip of France, Sir John is dismayed to discover that the English court is a hotbed of greed, corruption and petty in-fighting.\nThe murder of one of the palace clerks, stabbed in broad daylight and thrown into the River Thames, leads John to suspect that there's a conspiracy underway to overthrow King Richard. And with the visit of the dowager Queen Eleanor fast approaching, the new Coroner must risk his life to prove his suspicions are right, root out the traitors within and prevent a national catastrophe.", "author": "Bernard Knight"}, {"title": "Crude World: The Violent Twilight of Oil", "isbn": "1400041694", "averageRating": "3.75", "description": "A stunning and revealing examination of oil's indelible impact on the countries that produce it and the people who possess it.\nEvery unhappy oil-producing nation is unhappy in its own way, but all are touched by the \"resource curse\"--the power of oil to exacerbate existing problems and create new ones. In Crude World,Peter Maass presents a vivid portrait of the troubled world oil has created. He takes us to Saudi Arabia, where officials deflect inquiries about the amount of petroleum remaining in the country's largest reservoir; to Equatorial Guinea, where two tennis courts grace an oil-rich dictator's estate but bandages and aspirin are a hospital's only supplies; and to Venezuela, where Hugo Chavez's campaign to redistribute oil wealth creates new economic and political crises.\nMaass, a New York Times Magazinewriter, also introduces us to Iraqi oilmen trying to rebuild their industry after the invasion of 2003, an American lawyer leading Ecuadorians in an unprecedented lawsuit against Chevron, a Russian oil billionaire imprisoned for his defiance of Vladimir Putin's leadership, and Nigerian villagers whose livelihoods are destroyed by the discovery of oil. Rebels, royalty, middlemen, environmentalists, indigenous activists, CEOs--their stories, deftly and sensitively presented, tell the larger story of oil in our time.\nCrude Worldis a startling and essential account of the consequences of our addiction to oil.", "author": "Peter Maass"}, {"title": "D.Gray-man, Vol. 16: Blood & Chains", "isbn": "", "averageRating": "4.46", "description": "Lenalee is determined to confront a Level 4 Akuma that's out to kill Komui, but her only chance is to reclaim her Innocence and synchronize with it. The Level 4 is not inclined to wait around and pursues its mission even against the best efforts of Lavi and Kanda. It's left to Allen to hold the line, but it soon becomes obvious he has no hope of doing it all by himself!", "author": "Katsura Hoshino"}, {"title": "Dead in the Morning (Patrick Grant, #1)", "isbn": "0854563903", "averageRating": "3.30", "description": "Gerald breezily introduced his wife, Helen, to Mrs. Mackenzie, \"the greatest cook in the world\". Smoothing her hands on her apron, Mrs. Mackenzie smiled pleasantly -- and then her expression changed. Cathy noticed suddenly what a piercing glance came from her bright blue eyes when she was interested. She could not be said to stare, in the sense that Gran did, but nevertheless she was summing Helen up just as shrewdly. Her gaze narrowed. Her hand that she had been about to extend dropped to her side. Helen's already pale face had turned a chalky white ...", "author": "Margaret Yorke"}, {"title": "Deception (Defiance #2)", "isbn": "0062294482", "averageRating": "3.95", "description": "Baalboden has been ravaged.\nThe Commander's whereabouts are unknown. And with a ragged group of survivors struggling to stay alive, it's up to Logan to become the leader they need - with Rachel by his side. Under constant threat from rival city-state Carrington's army, which is after the device that controls the Cursed One, the group leaves their home and takes their chances in the Wasteland.\nBut soon their problems intensify tenfold: Someone - possibly inside their ranks - is sabotaging the survivors, picking them off one by one. The chaos puts unbearable strain on Rachel and Logan, and it isn't long before they feel their love splintering. And soon the group begins to question whether the price of freedom may be too great - and whether they can make it out of the Wasteland alive.\nIn this daring sequel to Defiance, with the world they once loved forever destroyed, Rachel and Logan must decide between a life on the run and standing their ground to fight.", "author": "C.J. Redwine"}, {"title": "Eighteenth-Century Europe: Tradition and Progress, 1715-1789", "isbn": "0393929876", "averageRating": "3.57", "description": "The new second edition of the standard text on eighteenth-century Europe draws on the most important recent developments in the field to enrich its compact, accessible, and thematic history. There are several advantages to adopting this text.", "author": "Isser Woloch"}, {"title": "Erotic Diaries of a Warlock: Book 1 of 3", "isbn": "", "averageRating": "2.52", "description": "Justin Kairo, a young man coming of age, is searching for his own identity. He cannot find his place in the world until he accepts his own magical powers and embraces his destiny as a warlock.", "author": "Justin Kairo"}, {"title": "FIRST WEEK AT COW SCHOOL", "isbn": "0007274688", "averageRating": "3.53", "description": "Starting school is full of fun in this laugh-out-loud sequel to The Cow That Laid and Egg and The Best Cow in Show.\nMarjorie the cow feels jolly proud when her daughter, Daisy, starts school. But lessons aren't as easy as they seem... Daisy can't hoof paint or swat flies like the other cows, and cowpat training is a disaster!\nYet, Marjorie soon discovers that Daisy has a surprising talent to make her stand out from the herd!", "author": "Andy Cutbill"}, {"title": "Fairy Tales: Dramolettes", "isbn": "0811223981", "averageRating": "3.83", "description": "Fairy Tales gathers the unconventional verse dramolettes of the Swiss writer Robert Walser. Narrated in Walser's inimitable, playful language, these theatrical pieces overturn traditional notions of the fairy tale, transforming the Brothers Grimm into metatheater, even metareflections.\nSnow White forgives the evil queen for trying to kill her, Cinderella doubts her prince and enjoys being hated by her evil stepsisters; the Fairy Tale itself is a character who encourages her to stay within the confines of the story. Sleeping Beauty, the royal family, and its retainers are not happy about being woken from their sleep by an absurd, unpretentious, Walser-like hero. Mary and Joseph are taken aback by what lies in store for their baby Jesus.", "author": "Robert Walser"}, {"title": "Fear the Darkness", "isbn": "", "averageRating": "3.77", "description": "A breathtakingly original thriller from the most exciting new voice in American crime fiction.\nBrigid Quinn has been shot at, stabbed in the spleen with a nail file and used as serial-killer bait. But she's always been able to trust her instincts and her FBI training to help her out of danger.\nNow, retired from the Bureau and investigating the tragic death of a neighbour's teenage son, Brigid starts to suffer unexplained bouts of paranoia, hallucination and memory loss.\nAnd for the first time in her life, she feels vulnerable.\nWith a mass poisoning at the church, a dead man in town and a grieving family convinced their son's death wasn't an accident, Brigid needs to put the pieces together - fast.\nBecause evil has entered her life once more, and it's much closer than she thinks . . .", "author": "Becky Masterman"}, {"title": "Fire and Sword", "isbn": "0749008954", "averageRating": "3.65", "description": "Returning to camp from a dangerous solo mission behind enemy lines, career soldier Daniel Rawson finds himself stranded on foot, with French soldiers in fierce pursuit. With a help of a farmer Daniel manages to escape. Later, when Daniel goes back to return the horse, he finds the farmhouse and barn have been set ablaze and the farmer approaching death, apparently at the hands of English soldiers. After several other farmhouses are burnt down in seemingly similar raids, Daniel decides to investigate. Back in England there is political unrest. Having lost royal favor the Duke of Marlborough to forced to resign as Commander-In-Chief. And all the while the treacherous and scheming French Commander, the Duc de Vendome, is becoming hell-bent on capturing Daniel, by any means at his disposal.REVIEWS \"A battle gone bad is a quick way to end up in a mountain of trouble. \"Fire and Sword\" follows Captain Daniel Rawson as he flees the pressures of the French forces in early eighteenth century Europe. As a nefarious general of the French forces uses any means necessary to bring them to their justice, Rawson has to overcome the odds of being stranded before not only does turmoil destroy his homeland, but he loses the love of his life. \"Fire and Sword\" is a riveting work of historical fiction, highly recommended.\"Midwest Book Review, 2011/04", "author": "Edward Marston"}, {"title": "Fire in the Hole: Stories", "isbn": "", "averageRating": "3.87", "description": "In this superb short fiction collection, Elmore Leonard, \"the greatest crime writer of our time, perhaps ever\" (New York Times Book Review), once again illustrates how the line between the law and the lawbreakers is not as firm as we might think. In the title story, the basis for the hit FX series Justified, U.S. Marshal Raylan Givens meets up with an old friend, but they're now on different sides of the law. Federal marshal Karen Sisco, from Out of Sight, returns in \"Karen Makes Out,\" once again inadvertently mixing pleasure with business. In \"When the Women Come Out to Dance,\" Mrs. Mahmood gets more than she bargains for when she conspires with her maid to end her unhappy marriage. \nThese nine stories are the great Elmore Leonard at his vivid, hilarious, and unfailingly human best.", "author": "Elmore Leonard"}, {"title": "Flesh & Blood (Flesh, #2)", "isbn": "1632168812", "averageRating": "3.87", "description": "Detective Cristian Flesh is about to find out that he can only run from his past for so long.\nWhen a local man is attacked and the suspect is a hustler, Cristian knows there's more to the case than meets the eye. His investigation will lead him into a maze of lies, deceit, and underage prostitution. But that's only the beginning as people start disappearing and turning up dead.\nCristian begins to realize that solving the case and stopping the murders won't be enough. If he wants to make his new life with lawyer Colby Maddox work, he'll need to face the demons of his past and put them to rest once and for all.\nWord count: 70,475", "author": "Ethan Stone"}, {"title": "For Her Protection: An Alpha Romance", "isbn": "", "averageRating": "3.91", "description": "\"I was amazed. It's a roller coaster of fear, suspense, love, and lust all wrapped up into a 5/5 book!\" --Valerie, MamivalsBooks \nYou shouldn't mix business with pleasure. \nYet pleasure seems to be the one and only thing on Charlize's mind the moment Connor steamrolls into her life. Desperate to save her family company, prove she's more than a pretty face and worthy of being CEO, pleasure is a distraction she can't afford.\nShe doesn't want a bodyguard, especially not one whose caveman heroics kick her libido into hyperdrive. Surrounded by enemies, she's not sure if Connor is a man she can trust.\nConnor knows better than to get personal with clients. Yet there couldn't be anything more personal about his feelings for Charlize. He'll win her trust, preferably one orgasm at a time.\nWith Connor in her office, her home, driving her to sweet, merciless distraction, there's only so long Charlize can resist his sexy, dominant brand of protection.\nWARNING: This is an Amber Bardan Alpha Romance, featuring one dirty-talking hero obsessed with his heroine, and a Happily Ever After. No cliffhangers.", "author": "Amber A. Bardan"}, {"title": "Gillian of the Chalet School", "isbn": "0953626954", "averageRating": "3.67", "description": "Following events of The New Chalet School, Gillian of the Chalet Schoolshows Gillian Linton's time as head girl as well as the whole school coping with the new arrangements of mixing seniors, middles and juniors together in the separate Houses.", "author": "Carol Allan"}, {"title": "Grace for Drowning", "isbn": "", "averageRating": "3.84", "description": "From the New York Times, USA Today and Wall Street Journal best-selling author of The Alpha Group comes a new romance about the devastating power of guilt and two people's struggle to overcome their pasts. \nHope is a dangerous thing. I know that more than most. Everything good I've ever had has been stolen from me -- my friends, my fiance, my innocence, some would say even my sanity. All I have left is the cage. Fighting is the only thing that eases the ache inside me even a little. It's the only thing that keeps the bottle at bay.\nI was content to ride out my life alone. I was done dreaming that things could be better. But then I met Grace, and from that moment, all I could do was dream.\nShe's battling those same demons, only she's losing. I don't want to care, but something about her calls to me. That pain in her eyes is so sharp, so familiar. I know it's only a matter of time before it pulls her below the surface.\nI can help her, and maybe, just maybe, she can help me too. For the first time in what feels like forever, I've got hope, and that scares the hell out of me.\nThis book is told from dual perspectives, so both Grace and Logan get their say. It is a full length (300 page) novel with no cliffhanger. There is likely to be a sequel, but the story can be enjoyed alone.\nNot suitable for younger readers. This is an intense story that deals with issues of alcoholism and military PTSD, and it contains adult content.", "author": "Maya Cross"}, {"title": "Growltiger's Last Stand and Other Poems", "isbn": "0374428115", "averageRating": "4.38", "description": "Three poems describe the nighttime adventures of some rather special cats.", "author": "T.S. Eliot"}, {"title": "Guardian Cougar (Finding Fatherhood, #2)", "isbn": "", "averageRating": "4.31", "description": "In the Finding Fatherhood series, these shifters become daddies in unconventional ways.\nCougar-shifter Jackson Sperry rescues Hannah from the ocean, and she has no memory of how she ended up floating in the Pacific. She also doesn't remember who she is or how she came to be pregnant. He's drawn to her and determined to protect her as they unravel the mystery of her past. It isn't long before he's ready to claim her as his mate and raise her son as his own--but without knowing the details of her past, the future remains uncertain, and he fears someone is still hunting Hannah and her baby.", "author": "Kit Tunstall"}, {"title": "Half Bad (Half Life, #1)", "isbn": "0698143760", "averageRating": "3.80", "description": "Wanted by no one.\nHunted by everyone.\nSixteen-year-old Nathan lives in a cage: beaten, shackled, trained to kill. In a modern-day England where two warring factions of witches live amongst humans, Nathan is an abomination, the illegitimate son of the world's most terrifying and violent witch, Marcus. Nathan's only hope for survival is to escape his captors, track down Marcus, and receive the three gifts that will bring him into his own magical powers--before it's too late. But how can Nathan find his father when there is no one safe to trust, not even family, not even the girl he loves?\nHalf Badis an international sensation and the start of a brilliant trilogy: a gripping tale of alienation and the indomitable will to survive.", "author": "Sally Green"}, {"title": "Happy Life", "isbn": "1556593740", "averageRating": "4.17", "description": "\"David Budbill is a no-nonsense free-range sage who celebrates tomatoes in September, the whistle of a woodcock and sweet black tea and ancient Chinese poems.\" --New York Times\"Budbill both informs and moves. He is, in short, a delight and a comfort.\"--Wendell Berry\"[Budbill] can be hilarious, as when he gripes, 'What good is my humility / when I am / stuck / in this obscurity?'\"--Booklist, starred review\"His terse, epigrammatic lyrics are a lilting mirror of classical Chinese poetry.\"--The Wichita EagleDavid Budbill continues his popular poetic ruminations on life in remote New England--an outward survey of a forested mountain and an introspection of self-reliance, anonymity, and the creative life. Inspired by classical Chinese and Japanese poets, Budbill contemplates the seasons, ambition, his questionable desire for fame and fortune, and simple, focused contentment: \"Weed the beans. Pick the peas.\"\"Out in the Woods\"The only time I'm really free is when I'm out in the woodscutting firewood, stacking brush, clearing trails.Just the chain saw, the dog and me.Heave and groan, sweat and ache.Work until I can't stand it anymore.Take a break.Sit on the needle-strewn ground up against a big pine tree,drink some water, stare out through the woods, pet the dog.Stretch out on the ground, take a nap,dog's head on my lap.Ah, this would be the time and place and wayto die.David Budbill is the author of poems, plays, essays, speeches, and book reviews. He has also served as a commentator on NPR's All Things Considered. He lives in the mountains of northern Vermont where he tends his garden and website.", "author": "David Budbill"}, {"title": "Hatchling's Vengeance (Dragshi Chronicles #4)", "isbn": "", "averageRating": "4.33", "description": "Glyn, former bodyguard and companion to a dragon lord, is now Lady Glynnes Janaleigh, a dragon lord in her own right. And she has found her intended mate. But, her new-found happiness is fleeting. Finding your mate is only half the battle. Keeping them alive is the other.\nFor a dragshi, duty is more than administering justice or saving the innocent. More than one suitor has fallen from the sky during a mating flight. Even worse, fate decrees mating fights don't always involve the partner you want.\nVengeance takes many paths. The leader called the Parant means to have his, no matter how long it takes or how many innocents die in the attempt. For the last two unattached dragon shifters, their only weapons to survive their destinies are their swords--and love. Sometimes not even dragon fire and talons are enough to overcome the mind control wielded by the leader called--the Parant.\nBook Four of the Dragshi Chronicles continues the tale of the dragshi, a human who can exchange bodies with a dragon. But the freedom of the skies comes with a price.\nAlthough the stories in the Dragshi Chronicles are connected, each book stands alone as an individual read", "author": "Helen Henderson"}, {"title": "Healer's Touch (Hearts And Thrones, #4)", "isbn": "", "averageRating": "3.75", "description": "Marius believes himself to be an ordinary small-town apothecary - until the imperial guards show up at his door. Then he learns the truth: he is cousin to the Kjallan emperor. Before he was born, his mother eloped with her beloved, leaving the palace and its intrigues behind. Now Marius returns to the imperial seat, where he will learn healing magic and struggle to adapt his small town soul to big city life.\nMeanwhile, the neighboring nation of Sardos has collapsed, and refugees are pouring over the border. Isolda, a Sardossian shopkeeper, is among them.She has fled her cruel husband and now ekes out a living on the streets of the imperial city.\nWhen Marius meets Isolda in the aftermath of a factory explosion, he falls for this determined woman who, like him, is far from home and struggling to find her place. But Isolda faces daily discrimination and harassment, while Marius's imperial relatives parade before him a bevy of women they deem more suitable to his station. Marius must decide: is he the emperor's dutiful cousin, grateful for the gifts that have been given him, or is he his mother's son, prepared to sacrifice everything for love?", "author": "Amy Raby"}, {"title": "Home and Heart", "isbn": "", "averageRating": "3.52", "description": "It's December in the Cotswolds, deep in the heart of England, and Ben Elliot of Home-Safe House & Pet Sitting is looking after Mrs Bonney's home and two dogs while the elderly lady is away for two months recovering from an operation. When her black-sheep grandson, Adam Prescott, turns up on the doorstep, Ben has to take in the stray human as well. Adam, hurting and betrayed by family, boyfriend and Fate, needs to have his faith in others restored, and Ben decides he is the one to do it.\nHaving gone through an acrimonious split with his boyfriend, Adam has no home, no money, no job and nowhere to go, except his grandmother's house. The son of an abusive, violent father, there's a lot of anger and resentment in him, demons he must exorcise. When he learns an unpleasant truth about his father, Ben helps him come to terms with it, and to find a new direction for his life - together, Ben hopes. But then Adam's ex-boyfriend shows up, offering him the world on a platter if only Adam will come back to him.\nChristmas may not be a time of celebration for Ben.", "author": "Chris Quinton"}, {"title": "Hope's Daughter", "isbn": "", "averageRating": "3.80", "description": "Life should be simple for Cassie.\nFor the small population of Earth survivors who live on the Space Station Hope everything they do is planned and scheduled, down to the cyclical food menus, their roles in the station, even how many children they have.\nDespite rigid controls directing her life, Cassie feels more out of synch than ever and worries she won't find a place for herself within the station community. Perhaps that's because she's hearing things inside her head that can't possibly be real. Or maybe it's the regular elopements of her peers, heading off to a romantic future in the Married Quarter of the space station, whilst she's never even been attracted to a boy - no matter how hard her best friend Ami pushes them at her. Then there are the odd questions her work placement partner Balik keeps raising. His questions are just as troubling for her as his distracting smiles and eyes that seem to see inside her.\nAs Cassie draws closer to Balik she finds that everything else in her life begins to shift. He tells her things that call into question the system they live within. She can't believe he is right, but at the same time she finds it hard to deny the sincerity of his ideas. Could there be a connection between Cassie's problems and Balik's questions? The truth will drag them both to a terrifying and deadly conclusion beyond anything they could have imagined.", "author": "Melanie Cusick-Jones"}, {"title": "Humpty Dumpty", "isbn": "1404881727", "averageRating": "3.39", "description": "Illustrator Charles Reasonor's charming version of the traditional nursery rhyme Humpty Dumpty. Word balloons add a touch of sweet humor to a familiar tale.", "author": "Charles Reasoner"}, {"title": "If I Can't Have You (The Thorntons #3)", "isbn": "", "averageRating": "4.34", "description": "Abby Davison only wants to focus on her career as a nurse, as she has no time for dating after a bad breakup over a year ago. When her mother presses her about settling down, Abby tells her a little white lie: she's dating Mark Thornton, the handsome and gruff rancher who both frustrates and makes her heart flutter every time they meet.\nWhen Mark overhears Abby's lie, he decides to cut her a deal: to keep his silence regarding their make-believe relationship, she'll come to live with him on his ranch until his broken arm heals.\nDespite her wounded pride and initial trepidation, Abby can't help but begin to fall for the guarded Thornton brother as the days pass on his ranch.\nThe black sheep of the family, Mark makes no secret that he prefers horses over people. His brusque exterior, though, only conceals hidden depths and a wounded heart that Abby understands all too clearly.\nAs feelings start to bloom between them, neither is sure what is real and what's make-believe. Yet the sizzling attraction between them is anything but fake, and with every kiss and every touch, they fall harder for each other.\nBut as their pasts begin to creep toward them, unearthing secrets both would rather keep buried, Abby and Mark must learn to trust each other--or risk losing the love both never knew they needed.", "author": "Iris Morland"}, {"title": "In These Words: Chapter 1", "isbn": "", "averageRating": "4.30", "description": "Asano Katsuya is the spirit of the United States experienced pathologist, He is recruited to police stations in Tokyo to accept a serial murder suspect for personality profiling work. (\"Personality profiling\" - the spirit of forensic experts to test the behavior of the suspect or speculate that, after a report of items listed) Tokyo police think he planted the suggestion of a clever scam, a few months, to be able to apprehend suspects justice ...... However, things aren't really so smooth as they planned it.", "author": "Kichiku Neko"}, {"title": "Inherit the Wind", "isbn": "0553269151", "averageRating": "3.96", "description": "A meaningful play based on the Scopes Monkey Trial of 1925, in which a Tennessee teacher was tried for teaching evolution. The accused was a slight, frightened man who'd deliberately broken the law. His trial was a Roman circus, the chief gladiators being the two great legal giants of the century. Locked in mortal combat, they bellowed & roared imprecations & abuse. The spectators sat uneasily in the sweltering heat with murder in their hearts, barely restraining themselves. America's freedom was at stake.", "author": "Jerome Lawrence"}, {"title": "Into Temptation", "isbn": "", "averageRating": "4.75", "description": "Into Temptation is the debut collection of poems from Sophia Blackwell, a regular on the UK poetry scene who has been holding crowds spellbound for over five years in bars, nightclubs, and festival tents.\nSophia takes us through love in all its guises - burning obsession, one-night stands that last too long, domestic bliss, and the insecurities in even the most loving relationships. Here also is a series of elegies for the everyday - the quiet, mysterious pleasures of Tube journeys, cats, and spaghetti sauce.\nInto Temptation is all lipstick, corsets and hedonistic jazz-fuelled rhythms, raging against and revelling in life.", "author": "Sophia Blackwell"}, {"title": "It Blows You Hollow", "isbn": "0932826652", "averageRating": "4.66", "description": "With these dark, triumphant poems, Diane Seuss takes us on a journey through the landscape of the soul and it's a world full of beauty and violence in equal parts. Relentless and incantatory, these poems are charged with an almost religious intensity as Seuss looks for God's presence in nature and sexuality. Again and again the poet confronts whatever it is that guides us through a life that is sensuous, yet exacting in its terrible cost.\nNothing is solved by the end of this book, but much is gained as the quest itself has become a victory of perfectly pitched and furious language. God's still hidden away, but by now the natural world has evolved to replace the absence Seuss feels. In the book's erotically charged universe, one paradoxically begins to feel a calm settle over the burned-up panorama of the soul. It Blows You Hollow is a book, rare these days, that feels as if it had to be written. Diane Seuss goes for broke.\"", "author": "Diane Seuss-Brakeman"}, {"title": "It's Funny Where Ben's Train Takes Him", "isbn": "0531301060", "averageRating": "3.68", "description": "Ben draws a train that takes him to all sorts of wonderful places before returning him to his own bed.", "author": "Robert Burleigh"}, {"title": "Itsy Bitsy Spider", "isbn": "1404881735", "averageRating": "3.14", "description": "Illustrator Charles Reasonor's charming version of the traditional nursery rhyme Itsy Bitsy Spider. Word balloons add a touch of sweet humor to the familiar tale.", "author": "Charles Reasoner"}, {"title": "Jung: A Graphic Guide", "isbn": "1848310102", "averageRating": "3.73", "description": "Brilliantly explains how Jung broke away from Freud, and describes his own near-psychotic breakdown, a night-sea voyage from which he emerged with new insights into the unconscious mind.", "author": "Maggie Hyde"}, {"title": "Keeping the World Strange:  A Planetary Guide", "isbn": "", "averageRating": "3.81", "description": "A snowflake that describes the multiverse. A team of archaeologists with a mystery benefactor. A century of pulp heroes, atomic ants, kung-fu ghosts, and ships that sail between universes. Villains who hide these wonders from a world they have sold to an unfathomable alien intelligence. And the man, born with the 20th century, who alone can save the world... and his lost friend.\nThese are the elements of PLANETARY. In telling its story, creators Warren Ellis and John Cassaday uncovered the secret history of the super-hero genre and helped point towards its future, as well as -- just perhaps -- our own.\nKEEPING THE WORLD STRANGE: A PLANETARY GUIDE excavates all of this, as well as future studies, revisionism, decompression, whether the characters are proactive or reactive, and other topics. This book offers an archaeology of the archaeologists, and its essays allow us to see the snowflake-like structure of the series from new angles. PLANETARY lives and grows in these pages.\nFrom Sequart Research & Literacy Organization. More info at http://Sequart.org", "author": "Cody  Walker"}, {"title": "Labyrinth (Languedoc Trilogy, #1)", "isbn": "0752860534", "averageRating": "3.55", "description": "In this extraordinary thriller, rich in the atmospheres of medieval and contemporary France, the lives of two women born centuries apart are linked by a common destiny.\nJuly 2005. In the Pyrenees mountains near Carcassonne, Alice, a volunteer at an archaeological dig stumbles into a cave and makes a startling discovery-two crumbling skeletons, strange writings on the walls, and the pattern of a labyrinth; between the skeletons, a stone ring, and a small leather bag.\nEight hundred years earlier, on the eve of a brutal crusade to stamp out heresy that will rip apart southern France, Alais is given a ring and a mysterious book for safekeeping by her father as he leaves to fight the crusaders. The book, he says, contains the secret of the true Grail, and the ring, inscribed with a labyrinth, will identify a guardian of the Grail. As crusading armies led by Church potentates and nobles of northern France gather outside the city walls of Carcassonne, it will take great sacrifice to keep the secret of the labyrinth safe.\nIn the present, another woman sees the find as a means to the political power she craves; while a man who has great power will kill to destroy all traces of the discovery and everyone who stands in his way.", "author": "Kate Mosse"}, {"title": "Little Boy Blue: A Memoir in Verse", "isbn": "1933880228", "averageRating": "4.09", "description": "Little Boy Blue is a lyrically-charged dramatic monologue in the voice of a mother to her absent son. In twenty-three movements, the speaker reveals the facts, feelings, textures, perspectives and sensations that inform this most personal and intense relationship, one that survives betrayal, abandonment, neglect, mental illness and other calamities of contemporary American life. Occupying the ground between poetry and prose, and with an ever-gathering momentum and passionate intensity, Jacobik examines motherhood, sanity, and heartbreakingly tender, resilient love.", "author": "Gray Jacobik"}, {"title": "Little Red Lies", "isbn": "1770493131", "averageRating": "3.19", "description": "The war is over, but for thirteen-year-old Rachel, the battle has just begun. Putting childhood behind her, she knows what she wants - to prove she has acting talent worthy of the school drama club, and what she doesn't want - to romantically fall for someone completely inappropriate. Worries about her veteran brother's failing health and repugnance at her mother's unexpected and unwanted pregnancy drive her to seek solace from a seemingly sympathetic, but self-serving teacher. The lies she tells herself hoping to reach solutions to the problems complicating her life merely function to make matters worse. Ultimately, she finds a way to come to terms with life as it reaches an end and life as it begins.", "author": "Julie Johnston"}, {"title": "Louder Than Everything You Love", "isbn": "1942004192", "averageRating": "5.00", "description": "Louder Than Everything You Love is about transformation. The narrator in these poems is many: women who talk to the dead, women who mourn dead mothers and grandmothers, women suicides, women who've been raped/escaped rape, women who cradle premature babies, women who suffer depression, women who prepare the bodies of the dead, women who exist between their children's bodily needs (\"this body-psalm of need the only holiness I know\") and saints' incorruptible bodies.\nThese women also live inside themselves, contending with the wolves within, asking: \"How do I measure the body's gardens form within its bone fences?\" The dead, the living and the divine inhabit this collection - they're looking for kinship, remembrance, for some kind of communion. The poems in Louder Than Everything You Love are about the struggle of living in a body, being a parent, trying to find the balance between what our lives on earth mean/what it means to come to terms with dying.", "author": "Nicole Rollender"}, {"title": "Lychee Light Club", "isbn": "1935654063", "averageRating": "3.74", "description": "The Lychee Light Club is considered Usamaru Furuya's breakthrough work. Originally designed as an experiemental project Lychee's themes of youthful rebellion and deus ex machina destruction, and attractive designs eventually won over a new generation of readers and critics, leading the way for Furuya to take on his many recent high profile properties.\nIn an abandoned warehouse, a band of nine students have assembled to plot out a new future. Their \"leader\" Zera is determined to cleanse his community of the ugly and cowardly. Having taken command of a band of young men to build him a god-like machine capable of changing the world. This machine, named \"Lychee,\" will give them what they've been searching for...a beauty of the finest quality.\nA surreal yet touching horror comedy Furuya's Lychee Light Club that mixes elements of French Le Theatre du Grand-Guignol and with modern day pop culture tropes and is set in modern day Tokyo. Shocking, sexy and innovative, the Lychee Light Clubis at the pinnacle of modern day Japanese seinenmanga (adult comics).", "author": "Usamaru Furuya"}, {"title": "Naked Soul: The Erotic Love Poems", "isbn": "0692265295", "averageRating": "3.95", "description": "\"Erotic poetry that evokes feelings of joy, happiness, and an overall celebration of the arts of physical and romantic love.\" - KIRKUS REVIEW\n\"Naked Soul: The Erotic Love Poems\" is an extraordinary storytelling in the form of erotic love poetry, speaking directly to the reader's heart through sensations that course throughout the body.\nThis powerful collection of erotic and sensual love poems celebrates the erotic spirit in all its forms -- from intense passionate sexual desire to seductive victory.\nThere are love poems for every mood and sentimental feeling, for every phase of love you are experiencing whether you are with a partner or not. Read it slowly. Read a poem at a time, or two-or all at once-but give it time to sink into your heart. Read them again. Visualize. Let the poem show you what may be lying dormant in your own heart.\nAny poetry lover who loves deep symbolism, storytelling and musing over deep verses will find this book very touching. No matter which phase of love you are growing in currently, this book will serve to sail you further towards the endless ocean of love.\n\"The book was as good a collection of modern erotic poems (by a single author) as may be found.\" - PoemShape\n\"You will feel something when you read this book. This [book] belongs to the author, [but] also to me, you and everyone.\" - MyBookShelfIsYours\n\"Highly Recommended.\" - KHouse", "author": "Salil Jha"}, {"title": "Naoki Urasawa's 20th Century Boys, Volume 19 (20th Century Boys, #19)", "isbn": "1421535378", "averageRating": "4.39", "description": "This is the story of a group of boys who try to save the world! As boys, Kenji and his friends came up with a bunch of stories about an evil organization bent on world destruction. As adults, someone is now turning their fantasies into reality!\nReads R to L (Japanese Style), for audiences T+.\nHumanity, having faced extinction at the end of the 20th century, would not have entered the new millennium if it weren't for them. In 1969, during their youth, they created a symbol. In 1997, as the coming disaster slowly starts to unfold, that symbol returns. This is the story of a group of boys who try to save the world.\nThe man with the guitar heads for Tokyo and arrives at a rough-and-tumble border town with an ominous-looking checkpoint. Only those who have a pass may go through, and those who try to get by without one are summarily shot. Many have tried, and many are buried nearby. Who can change this horrific situation and get through the checkpoint? And who or what could be waiting on the other side?", "author": "Naoki Urasawa"}, {"title": "Naoki Urasawa's 20th Century Boys, Volume 20 (20th Century Boys, #20)", "isbn": "1421535386", "averageRating": "4.41", "description": "This is the story of a group of boys who try to save the world! As boys, Kenji and his friends came up with a bunch of stories about an evil organization bent on world destruction. As adults, someone is now turning their fantasies into reality!\nReads R to L (Japanese Style), for audiences T+.\nHumanity, having faced extinction at the end of the 20th century, would not have entered the new millennium if it weren't for them. In 1969, during their youth, they created a symbol. In 1997, as the coming disaster slowly starts to unfold, that symbol returns. This is the story of a group of boys who try to save the world.\nThere once was a hero who stood against evil. He sacrificed himself to save the world, and everyone believed he died on Bloody New Year's Eve. But eighteen years later, when the entire world is under the control of the enigmatic figure known as the Friend, the hero comes back! Kenji is back and is heading for Tokyo, where the Friend is preparing his next horrific plan. Meanwhile, Kanna and the rest of Kenji's group make their move toward the final battle! Could it finally be time for justice to rise once again?", "author": "Naoki Urasawa"}, {"title": "Neil Young: The Definitive History", "isbn": "140279911X", "averageRating": "3.75", "description": "Neil Young is a rock icon, with a career unrivaled in its breadth, innovation, and success. This celebration of the man and his music tells the story of Young's nearly six-decade rock 'n' roll journey. It traces the singer/songwriter's memorable work with Crazy Horse, Buffalo Springfield, and Crosby, Stills, Nash & Young; his solo albums and tours; his activism, particularly for green causes and Farm Aid; and his personal life. Classic and rare images, record artwork, and contemporary press and marketing materials make this a sumptuous, must-have volume for every fan.", "author": "Mike   Evans"}, {"title": "Nemesis (Southern Comfort, #4)", "isbn": "", "averageRating": "4.09", "description": "Chosen as one of the Best Reads of 2013 by Kindles & Wine Blog.\nWhat happens when your childhood nemesis turns out to be the love of your life?\nThat's only one of the dilemmas Sadie Rose Mayhew must face when she returns to her childhood home. Seeking a fresh start after her broken engagement, Sadie moves into the house she left behind as a teen. Neglected since the death of her grandmother, Sadie sets about putting the place back together just as surely as she's repairing her life - the main problem at first being her next door neighbor.\nSadie remembers Declan Murphy as the pesky little brother of her best friend Kathleen, the fly in the ointment of her childhood. And when they encounter each other again on an adult playing field, the sparks they struck against each other as kids turn to full-fledged pyrotechnics - especially when Sadie's life is threatened on one of her first nights in town by two very aggressive burglars with an agenda.\nThere is something in Sadie's grandmother's house that her last renter left behind, something valuable enough to drive men to kill.\nAnd as both Sadie and Declan learn, sometimes your enemies are closer than you think.", "author": "Lisa Clark O'Neill"}, {"title": "On the Move: A Life", "isbn": "", "averageRating": "4.03", "description": "When Oliver Sacks was twelve years old, a perceptive schoolmaster wrote in his report: \"Sacks will go far, if he does not go too far.\" It is now abundantly clear that Sacks has never stopped going. From its opening pages on his youthful obsession with motorcycles and speed, On the Moveis infused with his restless energy. As he recounts his experiences as a young neurologist in the early 1960s, first in California, where he struggled with drug addiction, and then in New York, where he discovered a long-forgotten illness in the back wards of a chronic hospital, we see how his engagement with patients comes to define his life.\nWith unbridled honesty and humor, Sacks shows us that the same energy that drives his physical passions--weight lifting and swimming--also drives his cerebral passions. He writes about his love affairs, both romantic and intellectual; his guilt over leaving his family to come to America; his bond with his schizophrenic brother; and the writers and scientists--Thom Gunn, A. R. Luria, W. H. Auden, Gerald M. Edelman, Francis Crick--who influenced him.\nOn the Moveis the story of a brilliantly unconventional physician and writer--and of the man who has illuminated the many ways that the brain makes us human.", "author": "Oliver Sacks"}, {"title": "One Gay American", "isbn": "9781603811", "averageRating": "3.90", "description": "Dennis Milam Bensie is One Gay American. Born in the 1960s and raised with traditional values in Robinson, Illinois, Bensie desperately wanted romance, a beautiful wedding, and a baby to carry on the family name. He denied his sexuality and married a woman at nineteen years old, but fantasized of weddings where he could be the bride. The newlyweds \"adopted\" a Cabbage Patch Doll and ironically witnessed a Cabbage Patch Doll wedding (a successful fundraiser staged by a local women's club) where the dolls were granted the type of grand ceremony off-limits to gay couples. In search of his identity as a gay man, Bensie divorced his wife and stumbled through missteps and lessons that still sting his generation: defending against bullies, \"disappointing\" his parents, and looking for love in gay bars, bath houses and restrooms. He helped his straight friends plan their dream weddings and mourned his gay friends dying of AIDS. Although true love has not yet come his way, Bensie has learned to love himself. Bensie is the author of the much-lauded memoir, Shorn: Toys to Men, which recounts his battle with paraphilia. One Gay American tells the rest of his story and draws parallels to gay history, decade by decade, with newspaper headlines and quotations. Bensie is the gay neighbor that you either love or hate. Either way, he's got a lot to say and says it with no apologies.", "author": "Dennis Milam Bensie"}, {"title": "One for the Money (Night Huntress #4.5)", "isbn": "", "averageRating": "4.06", "description": "Previously published in Death's Excellent Vacation anthology and Magic Graves collection.\nAn exciting novelette set in Jeaniene Frost's Night Huntress world\nA romantic getaway for vampires Cat Crawfield and her husband Bones is cut short when they're called on to guard a spoiled heiress with a price on her head, and an undead hitman on her trail.\nWhat starts as a simple bodyguard job ends up being a fight for survival that neither Cat, nor Bones saw coming.", "author": "Jeaniene Frost"}, {"title": "Out of Order (The Survivor's Club, #1)", "isbn": "1634760123", "averageRating": "3.85", "description": "Corinna \"Corey\" Nguyen's life seems perfectly average for a closeted bisexual whiz kid with her eyes on college and a budding romance with her friend Kate. Sixteen and navigating senior year with her tight-knit group of best friends through crushes, breakups, and pregnancy scares, Corey mistakenly believes that running for valedictorian and choosing the right college are the worst of her worries. That is, until prom night, when she's left alone and in shock, hiding inside a diner restroom, the only witness to a multiple homicide.\nWith graduation looming, the pressure is on for Corey to identify the killer and ensure that the crime that has changed her life forever will not go unpunished.", "author": "Casey Lawrence"}, {"title": "Pandora Hearts, Volume 10", "isbn": "0316197289", "averageRating": "4.50", "description": "A century before, in Sablier, a forbidden portal was flung wide by a boy, Vincent, in his single-minded desire to protect his brother, Gilbert. And thus did that foolhardy desire lead to the corruption of that innocent boy's soul like a sweet poison... Now, as Gil, Oz, and Alice wander the ruins of the former capital, they are assaulted by illusions from the past. But how much of it is real? And how much of it illusion?", "author": "Jun Mochizuki"}, {"title": "Penny from Heaven", "isbn": "037583687X", "averageRating": "3.98", "description": "It's 1953 and 11-year-old Penny dreams of a summer of butter pecan ice cream, swimming, and baseball. But nothing's that easy in Penny's family. For starters, she can't go swimming because her mother's afraid she'll catch polio at the pool. To make matters worse, her favorite uncle is living in a car. Her Nonny cries every time her father's name is mentioned. And the two sides of her family aren't speaking to each other!\nInspired by Newbery Honor winner Jennifer Holm's own Italian American family, Penny from Heaven is a shining story about the everyday and the extraordinary, about a time in America's history, not all that long ago, when being Italian meant that you were the enemy. But most of all, it's a story about families--about the things that tear them apart and bring them together. And Holm tells it with all the richness and the layers, the love and the laughter of a Sunday dinner at Nonny's. So pull up a chair and enjoy the feast! Buon appetito!", "author": "Jennifer L. Holm"}, {"title": "Piercing the Reich", "isbn": "0345282809", "averageRating": "3.79", "description": "s/t: The Penetration of Nazi Germany by American Secret Agents During World War II\nAfter the success of such offensives as DDay & the Soviet march to the west, the Allies made the mistaken assumption that the 3rd Reich was finished. Then came the autumn of 1944. Hitler rallied with surprising force, driving the Allies back toward Paris. With a long war of attrition & no counterintelligence to speak of, the OSS set out to accomplish what the UK deemed impossible: to penetrate Nazi Germany with a network of spies. Locked away for over 30 years in secret CIA files, here's the true story of how American agents managed to infiltrate the 3rd Reich & shorten the war by months. Based on interviews with surviving operatives & filled with colorful profiles, this book brings to life one of the greatest counterintelligence coups in history--a heroic mission that established the USA as a superpower in international espionage. B&W photos.", "author": "Joseph E. Persico"}, {"title": "Playmaker: A Venom Series Novella", "isbn": "", "averageRating": "3.86", "description": "Secrets. Sometimes keeping them in confidence is a good thing. Other times secrets can slowly allow a woman's soul to rot.\nWhitney Beaupre has been hiding a big secret for years, one that's beginning to wear her down both on and off the ice. Pretending to be something she's not is exhausting. Wanting to be free but afraid to break out of her prison is terrifying. Seeking love but then hiding from it is crushing to the spirit, yet Whitney feels compelled to keep living the lie. Until the night Hannah Kym appears in her life. Whitney's attraction to Hannah is deep, fierce, and instantaneous. The Temple art major is everything Whitney has dreamed of and more. But those old fears keep clawing at the Venom center, keeping her locked in the closet despite the passion and affection she feels for Hannah.\nCan love finally break the shackles holding Whitney's heart and soul captive?", "author": "V.L. Locey"}, {"title": "Poetry is Not a Project", "isbn": "", "averageRating": "4.46", "description": "In a style much like her poetry--expansive, vulnerable, and never without fire--Dorothea Lasky delivers a theory of writing based as much in the Humanist tradition as Hermeticism. Calling poets away from civilization, back towards the wilderness, Lasky brazenly urges artists away from conceptual programs, resurrecting imagination and faith-in-the-uncertain as saviors from mediocrity.", "author": "Dorothea Lasky"}, {"title": "Princess of Fire (Fire, #1)", "isbn": "0821747967", "averageRating": "3.89", "description": "\"New York Times\" bestselling author Heather Graham, writing as Shannon Drake, offers the smoldering story of a land divided by treachery and a man and woman bound by passion. Although Alaric, a mighty Norman warrior, rescues Fallon from certain death, she tries desperately to resist this seductive enemy who vows to conquer her with a love that will turn her heart to fire.", "author": "Shannon Drake"}, {"title": "Revenge Of The Living Dummy (Goosebumps HorrorLand #1)", "isbn": "1407106937", "averageRating": "3.92", "description": "Britney Crosby encounters an old ventriloquist's dummy with a lively secret - and a wicked plan. Soon afterwards she receives an invitation to an amusement park where all is not as it seems. Who - or what - is summoning kids to HorrorLand? Britney and her friends must find out fast - or remain trapped forever in the scariest place on Earth!", "author": "R.L. Stine"}, {"title": "Salt & Stone (Fire & Flood, #2)", "isbn": "", "averageRating": "4.28", "description": "How far would you go to survive?\nIn FIRE & FLOOD, Tella Holloway faced a dangerous trek through the jungle and a terrifying march across the desert, all to remain a Contender in the Brimstone Bleed for a chance at obtaining the Cure for her brother. She can't stop - and in SALT & STONE, Tella will have to face the unseen dangers of the ocean, the breathless cold of a mountain, and twisted new rules in the race.\nBut what if the danger is deeper than that? How do you know who to trust when everyone's keeping secrets? What do you do when the person you'd relied on most suddenly isn't there for support? How do you weigh one life against another?\nThe race is coming to an end, and Tella is running out of time, resources, and strength. At the beginning of the race there were one hundred twenty-two Contenders. As Tella and her remaining friends start the fourth and final part of the race, just forty-one are left . . . and only one can win.\nVictoria Scott's stunning thriller will leave readers' hearts racing!", "author": "Victoria Scott"}, {"title": "Second Kiss (Second Kiss, #1)", "isbn": "1616637676", "averageRating": "3.86", "description": "'Even my most humiliating moments seemed funny somehow when I told them to Jess.' Gemma Mitchell is a normal girl who somehow gets herself into abnormally embarrassing circumstances. And while she thinks she's the biggest loser in school because of them, there are a few people in her life who would disagree. One of those people is her best friend, Jess Tyler, who is opposite to her in every way. He's popular, good looking, athletic, and intelligent, and he can't get enough of Gemma. But while Gemma is dealing with problems like wrong locker combinations and Valentine's Day dances, Jess is living in a world of serious issues that are foreign to Gemma, until she realizes that he's holding on to her for dear life. Humorous and true to life, Second Kiss is an entertaining saga about a boy and girl who find that their lives have a lot more meaning once they have shared them with each other.", "author": "Natalie Palmer"}, {"title": "Shadows of the Past", "isbn": "", "averageRating": "3.66", "description": "Alva cannot remember anything, not even the death of her baby in childbirth, and is horrified that her estranged husband Conte Luca Mazareeze should accuse her of trying to commit suicide. She cannot believe herself capable of such an act. Little by little, memories trip into her mind and it is only when she becomes the target of a murderer that she realizes she knows something that someone is afraid of her remembering. When she finally recalls what happened in the past she knows that life for her will never be the same again.", "author": "Margaret Blake"}, {"title": "She Wolf #1", "isbn": "", "averageRating": "1.86", "description": "SHE WOLF is a surreal exploration in horror as the story follows a teenage girl who believes she's been bitten by a savage werewolf. Soon after she begins to experience feverish nightmares that seamlessly bleed into her everyday reality.", "author": "Rich Tommaso"}, {"title": "Sherlock Holmes: Year One", "isbn": "1606902172", "averageRating": "3.16", "description": "Sir Arthur Conan Doyle's dauntless detective returns in an all-new series of adventures exploring the sleuth's untold origins! Join Dr. John Watson as he meets young Sherlock Holmes in a fateful encounter that will forever shape both men's destinies! Mysteries and murders most foul abound as we discover clues that reveal just how Holmes became the world's most famous detective.\nCollecting the 6-issue series in one volume, plus bonus material and a complete cover gallery.", "author": "Scott Beatty"}, {"title": "Shopping for a Billionaire (Shopping for a Billionaire, #1)", "isbn": "", "averageRating": "3.82", "description": "Length: 2 hours and 31 minutes\nWhen mystery shopper Shannon Jacoby meets billionaire Declan McCormick with her hand down a toilet in the men's room of one of his stores, it's love at first flush in this hilarious new romantic comedy from New York Times bestselling author Julia Kent.", "author": "Julia Kent"}, {"title": "Shroud of Darkness (Robert MacDonald, #39)", "isbn": "", "averageRating": "3.88", "description": "They were five strangers on a fogbound train--\na psychiatrist's pretty secretary,\nan agitated young man,\na tweedy lady with a deep voice,\na stockbrockerish businessman,\nand an eel-like \"spiv.\"\nOne was brutally attacked in the choking black fog in Paddington Station. Attempted murder became bona fide manslaughter, and examination of the intimate lives of the passengers involved Chief Inspector MacDonald in a macabre game of hide-and-seek in which one man tried to find his identity and another was ready to kill to preserve the shourd of darkness that obscured his.", "author": "E.C.R. Lorac"}, {"title": "Sir Chocolate and the sugar dough bees story and cookbook", "isbn": "", "averageRating": "4.55", "description": "A greedy snail damages the flower fields and the fondant bees are in danger of starving. Join Sir Chocolate on an adventure to find the fruit drop fairies who have magic healing powers and discover how to make some of his favourite foods on the way.", "author": "Robbie Cheadle"}, {"title": "Superior Spider-Man Team-Up: Superiority Complex", "isbn": "0785165363", "averageRating": "3.40", "description": "New creative team! New direction! The Superior Age begins, as the all-new Superior Spider-Man teams with Wolverine and the X-Men! Then, Spider-Man faces the future...the Future Foundation, that is. The Superior Spider-Man is forced to work with the FF as the literal future comes crashing in on them, threatening to destroy the Foundation itself and expose Spider-Man's ultimate secret! And didn't we mention that the new Spider-Man doesn't like kids?\nCOLLECTING:Avenging Spider -Man 16-19; 15.1", "author": "Christopher Yost"}, {"title": "Superman Archives, Vol. 2", "isbn": "0930289765", "averageRating": "4.06", "description": "These are the stories that catapulted Superman into the spotlight as one of the world's premier heroes of fiction. These volumes feature his earliest adventures, when the full extent of his powers was still developing and his foes were often bank robbers and crooked politicians.", "author": "Jerry Siegel"}, {"title": "Switched (Trylle Trilogy, #1)", "isbn": "", "averageRating": "3.89", "description": "Wendy Everly knew she was different the day her mother tried to kill her and accused her of having been switched at birth. Although certain she's not the monster her mother claimed she is she does feel that she doesn't quite fit in\nThe new girl in High School, she's bored and frustrated by her small town life and then there's the secret that she can't tell anyone. Her mysterious ability she can influence people's decisions, without knowing how, or why...\nWhen the intense and darkly handsome newcomer Finn suddenly turns up at her bedroom window one night her world is turned upside down. He holds the key to her past, the answers to her strange powers and is the doorway to a place she never imagined could exist.\nForening, the home of the Trylle. Everything begins to make sense to Wendy. Among the Trylle, she is not just different, but special. But what marks her out as chosen for greatness in this world also places her in grave danger.\nWith everything around her changing, Finn is the only person she can trust. But dark forces are conspiring not only to separate them, but to see the downfall everything that Wendy cares about. The fate of Forening rests in Wendy's hands, and the decisions she and Finn make could change all their lives forever...", "author": "Amanda Hocking"}, {"title": "Switched (Trylle, #1)", "isbn": "144721028X", "averageRating": "3.89", "description": "Wendy Everly knew she was different the day her mother tried to kill her and accused her of having been switched at birth. Although certain she's not the monster her mother claimed she is, she does feel that she doesn't quite fit in. The new girl in High School, Wendy is bored and frustrated by her small-town life -- and then there's her secret, her mysterious ability -- she can influence people's decisions, without knowing how, or why ...When the intense and darkly handsome newcomer Finn suddenly turns up at her bedroom window one night, her world is turned upside down. He holds the key to her past, the answers to her strange powers and is the doorway to a place she never imagined could exist: Forening, the home of the Trylle. Among the Trylle she is not just different, but special. But what marks her out as chosen for greatness in this world also places her in grave danger. With everything around her changing, Finn is the only person she can trust. But dark forces are conspiring -- not only to separate them, but to see the downfall of everything that Wendy cares about...", "author": "Amanda Hocking"}, {"title": "Tarzan of the Apes (Tarzan, #1)", "isbn": "", "averageRating": "3.88", "description": "In 1888 Lord and Lady Clayton sail from England but to West Africa and perish on a remote island. When their infant son is adopted by fanged, great anthropoid apes, he is Tarzan of the Apes. His intelligence and caring mother raise him to be king. Self-educated by his parents' library, Tarzan rescues genteel Jane Porter from the perils of his jungle.", "author": "Edgar Rice Burroughs"}, {"title": "The Aeneid for Boys and Girls", "isbn": "1599150603", "averageRating": "4.13", "description": "Relates in vigorous prose the tale of Aeneas, the legendary ancestor of Romulus, who escaped from the burning city of Troy and wandered the Mediterranean for years before settling in Italy. Patterned after the Iliad and the Odyssey, the Aeneid was composed as an epic poem by Virgil, to glorify the imperial city of Rome.", "author": "Alfred J. Church"}, {"title": "The Afterlife (Joe Vampire, #2)", "isbn": "", "averageRating": "3.75", "description": "So...yeah. It's me again. America's most sarcastic vampire.\nI'm back on the blog. It's been a while - about a year, if we need to get into specifics. Which I usually do. It's just a thing with me.\nA lot has happened since we last chatted - some good, some bad. All worthwhile, in the grand scheme. I've dealt with the whole Living Dead thing long enough now to know how to keep it from taking over my life. What I'm still figuring out is how to keep it from wreaking havoc on everyone else's lives. It's a roller coaster, for sure, but I'm convinced that waiting for me somewhere on the other side of the Other Side is a real-life life, not just some artificially-sweetened half-life substitute. I want a family. I want my music.\nI want the dream come true, not the dream fell through.\nAnd I'm determined to have it, regardless of how eternal this afterlife thing might be. But it's a hell of a lot to keep track of. Barring any unforeseen developments that might undo all my vampirosity, I may have to grow up a little in order to get it all to work out. I'm ready for that, though.\nAs fun as it might seem to hang with the Lost Boys, I can't be Peter Pan-pire forever.", "author": "Steven Luna"}, {"title": "The Belonging Series (Belonging #1-3)", "isbn": "", "averageRating": "3.14", "description": "Part I \nMultiracial, Deborah Withers' love for her mother has turned to hate. The gullible woman, after fifteen years, still believes her long-lost husband will magically return to her.\nWhen Deborah discovers her mother has jeopardized her future to Oxford by forging information on her financial application in an attempt to win her father back, she decides to leave her deluded mother and seek a better life for herself.\nShe believes any college is out of reach, until a guardian angel offers to pay all fees and accommodations for her at Oxford. She cannot believe her luck and turns her back on her mother.\nSoon, she finds out her guardian angel is not a blessing, but a curse.\nThe Belongingseries is sensual and mysterious, it will intrigue you and have you coming back for more. \nPart II \nDeborah has had a blissful three years since she last saw the Sparks. Her recollection of how her guardian angel who helped secure her dream of going to university turned into a nightmare were well and truly past her.\nShe was grateful that she was able to graduate. Grateful that the time she had spent apart from her mum had meant that there could be some sort of reconnection.\nUntil an announcement was made at the University assembly and everything was about to change. Deborah had to say goodbye to her dreams of becoming a teacher. Her grandmother was awaiting her return back home and so was the love of her life.\nDeborah's bliss is over and her nightmare has only just began!\nPart III\nAs Deborah listens to the truth behind the Spark's household, she starts to question her relationship with Roy. Deborah thought she knew it all. Roy had used her from the start and played with her innocence.\nUntil a chain of events occur and Deborah meets the one man that Roy never wanted her to meet. The more time she spends with him, the more she starts to doubt her decision. Is Deborah strong enough to survive in the billionaire's lifestyle? Was her gut feeling about Roy the one she should have hung on to, when she moved into the house stating this was the one place she belonged.\nThe conclusion to the Belongingseries will take you on a bumpy ride and have you wanting more.\nAuthor's note:Due to strong language and sexual content, this book is not intended for readers under the age of 18.", "author": "J.S. Wilder"}, {"title": "The Blood and Light Series (Blood and Light #1-6)", "isbn": "", "averageRating": "3.77", "description": "This contains all SIX novels and two shorts of the Blood & Light Vampire Series.\nBlood & Light (book #1)\nSmoke & Mirrors (book #2)\nOil & Water (book #3)\nClarity & Reason (book #4\nGrace & Beauty (book #5)\nHope & Faith (book #6)\nPLUS two bonus shorts\nBirth of a Vampire\nWill and Wonder\nRue lives in the quiet little town of Calvary, Minnesota with her brother Kai, and her parents, Grace and William. Calvary is a beautiful place, with no crime, no drama and nestled along the great lakes. It is surrounded in lush forests, quiet, safe, everything you could ever wish for...or is it?\nAs Rue approaches her 17th birthday she is plagued with one problem, a very big one. Her Mother, Grace, has fallen ill. It is not a disease that can easily be fixed with medication, it is one of the mind. Grace has been admitted to Rolling River Asylum and once she is gone, Rue's perfect world starts to crumble around her. Everything she has known is suddenly taken from her and with it her feeling of safety is dissolved.\nDesperate to pull Rue out of her depression, her brother talks her into going to a party at the Graph house, home to Johnathan Graph, a boy Rue has always felt a strong connection to, but never acted on it. Once she is at the party she reconnects with Johnathan and is shocked at how her feelings seem to be so strong for him, but with one touch Rue has a terrifying vision and it sets everything into motion.\nSoon after her revelation at the party, Grace and William suddenly disappear and with their absence two strangers, that of Joshua and Samantha Barrington, enter into Rue's life. They come as protectors, not only to her, but to everyone she loves. Without them she would be lost, but with them she is reminded of how much she does not know. There is a war coming, a war that threatens everything she loves, everything she knows or ever will know. She is forced to face the truth about herself and about her family's history, a truth that stems back to the beginning of time and that of the vampire.\nRewrite history through the eyes of the immortal.", "author": "Rue Volley"}, {"title": "The Body Electric", "isbn": "0990662616", "averageRating": "3.71", "description": "The future world is at peace.\nElla Shepherd has dedicated her life to using her unique gift--the ability to enter people's dreams and memories using technology developed by her mother--to help others relive their happy memories.\nBut not all is as it seems.\nElla starts seeing impossible things--images of her dead father, warnings of who she cannot trust. Her government recruits her to spy on a rebel group, using her ability to experience--and influence--the memories of traitors. But the leader of the rebels claims they used to be in love--even though Ella's never met him before in her life. Which can only mean one thing...\nSomeone's altered her memory.\nElla's gift is enough to overthrow a corrupt government or crush a growing rebel group. She is the key to stopping a war she didn't even know was happening. But if someone else has been inside Ella's head, she cannot trust her own memories, thoughts, or feelings.\nSo who can she trust?", "author": "Beth Revis"}, {"title": "The Call of Eirian (The Faelin Chronicles, #2)", "isbn": "0761462627", "averageRating": "3.89", "description": "Faelin twins Diello and Cynthe, children of a Fae mother and a human father, found their lives changed forever the day their parents were brutally murdered by a goblin horde. They discovered that their parents' cautious ways hid a lifetime of secrets, including Eirian, a magical sword buried on their farm. Now their little sister has been taken by someone who wants that sword and the ultimate power that comes with it.\nThe twins, along with their friends--a goblin boy and a talking wolf pup--will have to journey to Embarthi, the realm of the Fae, and seek the family they have never known to find their sister and the truth about their parents' mysterious past.", "author": "C. Aubrey Hall"}, {"title": "The Chivalry of Crime: A Novel", "isbn": "0316120847", "averageRating": "3.57", "description": "The Chivalry of Crime, is the story of one of America's most compelling figures, the outlaw gunslinger Jesse James. Bringing real and invented characters together in a dramatic and moving story, The Chivalry of Crime mingles the life of an imaginary boy with a factually faithful account of the lives of Jesse James and Robert Ford, the man who killed James, in the days when shootists were legends. Joshua, a young, idealistic friend of Ford's, is determined to get a gun of his own -- a desire that puts his own life in jeopardy and reveals the painful realities masked by some of America's most cherished myths.", "author": "Desmond Barry"}, {"title": "The Chocolate Clown Corpse (A Chocoholic Mystery, #14)", "isbn": "", "averageRating": "3.82", "description": "Revenge is sweet for a killer on the loose--and it all started with the murder of Warner Pier's most hated clown....\nEveryone who knew the bozo wanted him dead. Odd, then, that a complete stranger was accused of bursting Moe Davidson's balloons. But it's been a month since the miserable shop owner of Clowning Around was killed, and everybody's moving on, including Lee Woodyard. Her chocolate shop, TenHuis Chocolade, is next door to Moe's shuttered tourist trap, and it's giving her delicious ideas to expand. But over whose dead body?", "author": "JoAnna Carl"}, {"title": "The Cocktail Party", "isbn": "0156182890", "averageRating": "3.71", "description": "A modern verse play about the search for meaning, in which a psychiatrist is the catalyst for the action. \"An authentic modern masterpiece\" (New York Post). \"Eliot really does portray real-seeming characters. He cuts down his poetic effects to the minimum, and then finally rewards us with most beautiful poetry\" (Stephen Spender).", "author": "T.S. Eliot"}, {"title": "The Color of Us (College Bound, #2)", "isbn": "", "averageRating": "4.31", "description": "**This can be read as a standalone**\nEighteen year old Alexis Sinclair is lost in the darkness of grief. Since the death of her sister in a car accident, she can't find the will to get out and enjoy life again. When she's forced to face her biggest fear and take a summer Driver's Ed course, she's surprised to find hope in the most unlikely person.\nLiam O'Connell is trouble. He isn't proud of his dark past, and he knows Alexis is the one girl he has no business pursuing. Doing the right thing has never been easy for him, but this time, it just might be impossible.\nThe perfect girl and troubled boy are all wrong for each other, but as Liam helps Alexis cope with her grief, they realize nothing has ever felt more right.\nThat is, until Alexis uncovers a secret about Liam that breaks her heart.\nLiam knows he can't allow the one good thing in his life to walk away without a fight, and he's determined to convince Alexis they can find their way out of the darkness together.\nCan he prove he's worthy of her, or is some love too tainted to be saved?", "author": "Laura  Ward"}, {"title": "The Cost of Doing Business", "isbn": "8293326247", "averageRating": "4.14", "description": "\"Poetic, down trodden and nihilistic, Jonathan Ashley treads through parts of the human psyche that others fear for one black tar mind-fuck-ride of a novel.\"\n- Frank Bill, author of CRIMES IN SOUTHERN INDIANA and DONNYBROOK\nIn Jonathan Ashley's dark humor debut crime novel, a Louisville bookstore owner leaves his used volumes of Yeats behind to get into the drug trade and make some real money.\nJon Catlett, a misanthropic literary obsessive, is facing the loss of the only thing in the world he loves; his used bookstore, a haven for fellow weirdos, outcasts, misunderstood geniuses and malcontents. Jon has several other problems, the least of which are his love affair with a bi-polar femme fatale heiress to a thriving northern steel company or the exponentially growing opiate habit he has developed.\nWhen Jon, during a deal gone wrong, accidentally kills a fellow drug addict, getting away with murder turns out to be the least of his worries. The steps he and Paul, the obsessive-compulsive manager of Jon's store, must take to cover up the killing result in the two cornering Louisville's blossoming heroin trade.\nFrom West End gangbangers to dirty cops and crusading narcotics detectives, Jon and his unstable partner in crime must dilute their morals and thicken their skin if they are to have any hope of surviving the lucrative but deadly life they've stumbled upon.\nMORE PRAISE FOR THE COST OF DOING BUSINESS:\n\"Ashley breaks our hearts, he breaks all the rules and, most importantly, he breaks our expectations of what a simple crime story can be. He shatters it, in fact, leaving readers craving another deadly taste--much like the lost souls in this chilling, amazing story.\"\n- Patrick Wensink, author of BROKEN PIANO FOR PRESIDENT\n\"We live in a capitalistic society, yes, but nobody said doing business is easy or even enjoyable. Jonathan Ashley makes this point quite well in The Cost of Doing Business. Of course when the business is the heroin trade, the stakes are life and death, but is the suspicion, the betrayal, the plotting and scheming, all that different than what goes on in the corporate world? Louisville bookstore owner Jon Catlett leaves his used volumes of Yeats behind to get into the drug trade and make some real money, and the result is blood-filled mayhem. He never loses his sense of literate irony, though, taking us through a fast, unpredictable novel with equal parts darkness and humor. A very confident debut.\"\n- Scott Adlerberg, author of SPIDERS AND FLIES\n\"...poetic observations worthy of Daniel Woodrell or Matthew McBride\"\n- January Magazine", "author": "Jonathan Ashley"}, {"title": "The Crimson Petal and the White", "isbn": "015100692X", "averageRating": "3.87", "description": "\"Michel Faber leads us back to 1870s London, where Sugar, a nineteen-year-old whore in the brothel of the terrifying Mrs. Castaway, yearns for escape into a better life. Her ascent through the strata of Victorian Society offers us intimacy with a host of lovable, maddening, unforgettable characters.\" They begin with William Rackham, an egotistical perfume magnate whose ambition is fueled by his lust for Sugar, and whose patronage of her brings her into proximity to his extended family and milieu: his unhinged, child-like wife, Agnes; his mysteriously hidden-away daughter, Sophie; and his pious brother Henry, foiled in his devotional calling by a persistently less-than-chaste love for the Widow Fox, whose efforts on behalf of The Rescue Society lead Henry into ever-more disturbing confrontations with flesh.", "author": "Michel Faber"}, {"title": "The Dragons' Demon: A Dragon's Dream (Ethereal Foes, #1)", "isbn": "", "averageRating": "3.73", "description": "A prank gone wrong throws three unlikely partners together: A demon. A dragon. And an egg.\nIn the ordinary world, forces are at work which keep the balance of the universe in order. Enter Eve Sinclair, a higher demon with a mission--to sway those souls on the brink of Decision, to push them toward hell.\nAfter a prank played by her brothers, Eve finds herself holding the proverbial bag, accused of stealing a precious dragon egg. Worse, it's a royal egg, as she learns from Ranton, the furious commander of the dragon legion.\nNot a creature to have on one's bad side, Ranton shifts between his human and dragon forms, keeping Eve off-balance and off her game. Normally a master at manipulating males, Eve finds that Ranton is more than a match for her...as is his brother, the new dragon king. In their arms, she's mere putty.\nAnd soon they're not only molding her desires, but her heart.\nWarning, this title contains the following: explicit sex, graphic language, menage a troi, and steamy dragon love.\nNote: This book is a re-release of a previous edition.", "author": "Marie Harte"}, {"title": "The Dream of the City: A Novel", "isbn": "", "averageRating": "3.67", "description": "A story of love and the struggles of change that captures the artistry, history, and beauty of Antoni Gaudi's dreamlike architecture in Barcelona\nAmid the changes of the modernist movement in twentieth-century Barcelona, a miraculous encounter brings two families together. The lovely Laura Jufresa, daughter of a wealthy goldsmith and one of the most prominent artisans in the city, dreams of going to Rome to learn how to make the most avant-garde jewelry of her time. Dimas Navarros, part of a humble and hardworking but poor family, searches for enchantment in Barcelona. The entwinement of these two lives and the metropolis in which they must thrive will forever change their fates.\nCentered around the construction of Antoni Gaudi's phantasmagoric Sagrada Familia and the pull it has on each character, The Dream of the Cityis both a historical imagining and a vibrant vision of the shapes and people that bring Barcelona to life.", "author": "Andres Vidal"}, {"title": "The Falls", "isbn": "1921901993", "averageRating": "4.08", "description": "For as long as she can remember, Teagan Bliss has wanted to manage her family's property. She's invested everything in the farm, knowing that when her parents retire she'll be ready to take the reins. But when a family betrayal leaves her reeling, Teagan is forced to rethink her entire future.\nHeartbroken, Teagan flees to her aunt's property in the idyllic Falls Valley. Vanessa is warm and welcoming and a favourite of the locals who drop in regularly for cocktail hour. Teagan soon catches the attention of sexy local farrier Lucas Knight, and with a new job, new friends and the prospect of a new relationship, she slowly begins to open up again.\nBut the village is a hotbed of gossip and division and when Teagan gets caught up in town politics, Lucas and Vanessa become concerned. As the tension in town escalates, Teagan must decide who to trust. But when she realises those close to her have been keeping secrets, the fallout may split Teagan apart forever.", "author": "Cathryn Hein"}, {"title": "The Forgetting Curve (Memento Nora, #2)", "isbn": "0761462651", "averageRating": "3.64", "description": "Aiden Nomura likes to open doors--especially using his skills as a hacker--to see what's hidden inside. He just keeps pulling until one cracks open, exposing the flaws. The universe--or someone else--will fix things. It's like a game...until it isn't.\nWhen a Therapeutic Forgetting Clinic opens in Bern, Switzerland, near Aiden's boarding school, he knows things are changing. Shortly after, bombs go off within quiet, safe Bern. Then Aiden learns that his cousin Winter, back in the States, has had a mental breakdown. He returns to the US immediately.\nBut when he arrives home in Hamilton, Winter's mental state isn't the only thing that's different. The city is becoming even stricter, and an underground movement is growing.\nWith the help of Winter's friend Velvet, Aiden slowly cracks open doors in this new world. But behind those doors are things Aiden doesn't want to see--things about his society, his city, even his own family. And this time Aiden may be the only one who can fix things...before someone else gets hurt.", "author": "Angie Smibert"}, {"title": "The Grownup", "isbn": "1101907320", "averageRating": "3.54", "description": "A canny young woman is struggling to survive by perpetrating various levels of mostly harmless fraud. On a rainy April morning, she is reading auras at Spiritual Palms when Susan Burke walks in. A keen observer of human behavior, our unnamed narrator immediately diagnoses beautiful, rich Susan as an unhappy woman eager to give her lovely life a drama injection. However, when the \"psychic\" visits the eerie Victorian home that has been the source of Susan's terror and grief, she realizes she may not have to pretend to believe in ghosts anymore. Miles, Susan's teenage stepson, doesn't help matters with his disturbing manner and grisly imagination. The three are soon locked in a chilling battle to discover where the evil truly lurks and what, if anything, can be done to escape it.\nThe Grownup, which originally appeared as \"What Do You Do?\" in George R.R. Martin's Roguesanthology, proves once again that Gillian Flynn is one of the world's most original and skilled voices in fiction.", "author": "Gillian Flynn"}, {"title": "The Master and His Emissary: The Divided Brain and the Making of the Western World", "isbn": "0300168926", "averageRating": "4.26", "description": "Why is the brain divided? The difference between right & left hemispheres has been puzzled over for centuries. In a book of unprecedented scope, McGilchrist draws on a vast body of recent brain research, illustrated with case histories, to reveal that the difference is profound--not just this or that function, but two whole, coherent, but incompatible ways of experiencing the world. The left hemisphere is detail oriented, prefers mechanisms to living things & is inclined to self-interest. The right hemisphere has greater breadth, flexibility & generosity. This division helps explain the origins of music & language, & casts new light on the history of philosophy, as well as on some mental illnesses. The 2nd part of the book takes a journey thru the history of Western culture, illustrating the tension between these two worlds as revealed in the thought & belief of thinkers & artists, from Aeschylus to Magritte. He argues that, despite its inferior grasp of reality, the left hemisphere is increasingly taking precedence in the modern world, with potentially disastrous consequences.\nList of Illustrations\nAcknowledgments\nIntroduction\nAsymmetry and the brain --\nWhat do the two hemispheres 'do'? --\nLanguage, truth and music --\nThe nature of the two worlds --\nThe primacy of the right hemisphere --\nThe triumph of the left hemisphere --\nImitation and the evolution of culture --\nThe ancient world --\nThe Renaissance and the Reformation --\nThe Enlightenment --\nRomanticism and the Industrial Revolution --\nThe modern and post-modern worlds\nConclusion\nNotes\nBibliography\nIndex", "author": "Iain McGilchrist"}, {"title": "The Mermaid’s Madness", "isbn": "", "averageRating": "3.90", "description": "What would happen if a star writer went back to the darker themes of the original fairy tales for plots, and then crossed the Disney princesses with Charlie's Angels? What he'd end up with is The Mermaid's Madness--a whole new take on The Little Mermaid. And with Jim C. Hines, of Jig the Goblin fame, penning the tale, you can bet it won't be \"They lived happily ever after.\"\n11 hrs and 53 mins\n(c)2009 Jim C. Hines (P)2012 Audible, Inc.", "author": "Jim C. Hines"}, {"title": "The More Loving One", "isbn": "", "averageRating": "4.00", "description": "Free online poetry.\nFrom Random House's Boldtype.\nExcerpted from The Voice of the Poet: W.H. Auden by W.H. Auden.", "author": "W.H. Auden"}, {"title": "The Passion (Dark Visions, #3)", "isbn": "", "averageRating": "4.04", "description": "This is the final tale in the bestselling author L.J. Smith's romantic horrortrilogy. Now, Kaitlyn Fairchild and her friends must put the powerful crystalto the test--to stop an experiment that has turned one of them into a psychicvampire. Kaitlyn must choose at last--Rob or Gabriel.", "author": "L.J. Smith"}, {"title": "The Phantom Limb", "isbn": "0810984288", "averageRating": "2.68", "description": "Isaac is the new kid in town. His mother, Vera, is in the hospital with a mysterious illness, and the only person left to care for Isaac is his distant grandfather. Friendless and often alone, Isaac loses himself in his collection of optical illusions, including a strange mirror box that he finds in his new house, left behind by the previous tenants. Designed for amputees, it creates the illusion of a second limb.\nLonely Isaac wishes someone would reach out to him, and then someone does--a phantom limb within the mirror box! It signs to Isaac about a growing danger: someone who has murdered before and is out to get Vera next. The only way Isaac can solve the mystery and save his mother is with the help of the mirror box. But can he trust the phantom limb?", "author": "William Sleator"}, {"title": "The Pilgrim Adventure", "isbn": "147003798X", "averageRating": "3.68", "description": "Finn & Ginny's parents are lost back in time, and the two young twins have decided to go back to early America to find them. Their search takes the twins to the Mayflower where they discover that the Pilgrims had far more adventures than they had ever realized.\nThis first book in the Our America series is designed to teach the real story of the Pilgrims in such a fun way that the reader won't even realize that it's educational. The Pilgrim Adventure is based on actual accounts written by the Pilgrims themselves, and kids who read this book will find that by the end of the story they may know more about the Pilgrim's adventures than their parents do. Ages 10 and up.", "author": "Susan Kilbride"}, {"title": "The Pity Party: 8th Grade in the Life of Me, Cass", "isbn": "0439681952", "averageRating": "3.59", "description": "In its paperback debut, the sequel to Alison Pollet's NOBODY WAS HERE follows quick-witted Cass Levin, through the rugged terrain of 8th grade at New York City's Elston Prep.\nWhen eighth grade begins, Cass feels like the entire school is out to get her. She's stuck in classes without her closest friends Penelope and Tillie to keep her company. And as if that weren't bad enough, this is the year that students take an extended field trip to Elston Prep's nature retreat in the countryside.\nCass confronts her problems with spirited resilience, and she forges an unexpected friendship with Rod Punkin, the school's biggest behavior problem. When Rod goes missing, Cass embarks on a secret rescue mission in this funny, witty, and utterly moving story about being thirteen.", "author": "Alison Pollet"}, {"title": "The Prince and the Potty", "isbn": "0689878087", "averageRating": "3.33", "description": "The prince will not use his potty, and the king and queen are quite perplexed! They are even more confused when they consult the Royal Wise Man, who tells them to get the prince a puppy. But the wisdom of his words becomes perfectly plain as the prince learns all about using a proper potty from his new pet.", "author": "Wendy Cheyette Lewison"}, {"title": "The Queen Elizabeth Family (Family, #4)", "isbn": "0749729120", "averageRating": "3.66", "description": "Mike, Belinda and Ann can hardly contain their excitement. They are going to America on the Queen Elizabethand will spend two whole weeks in New York! They have their most exciting adventures yet, exploring the decks of the enormous ship and experiencing the whirl, bustle and sheer size of life in America.", "author": "Enid Blyton"}, {"title": "The Saturdays", "isbn": "0030896908", "averageRating": "4.14", "description": "Meet the Melendys! The four Melendy children live with their father and Cuffy, their beloved housekeeper, in a worn but comfortable brownstone in New York City. There's thirteen-year-old Mona, who has decided to become an actress; twelve-year-old mischievous Rush; ten-and-a-half-year-old Randy, who loves to dance and paint; and thoughtful Oliver, who is just six.\nTired of wasting Saturdays doing nothing but wishing for larger allowances, the four Melendys jump at Randy's idea to start the Independent Saturday Afternoon Adventure Club (I.S.A.A.C.). If they pool their resources and take turns spending the whole amount, they can each have at least one memorable Saturday afternoon of their own. Before long, I.S.A.A.C. is in operation and every Saturday is definitely one to remember.\nWritten more than half a century ago, The Saturdays unfolds with all the ripe details of a specific place and period but remains, just the same, a winning, timeless tale. The Saturdaysis the first installment of Enright's Melendy Quartet, an engaging and warm series about the close-knit Melendy family and their surprising adventures.", "author": "Elizabeth Enright"}, {"title": "The Serpent and the Rose (War of the Rose, #1)", "isbn": "0765313286", "averageRating": "3.49", "description": "The beautiful Averil is heir to the Duchy of Quitaine, in the Kingdom of Lys. She is a powerful mage, trained by the Ladies of the Isle, but when her father calls her home to take up her duties, she must leave that life behind. In her city of Fontevrai, she meets Gereint, raised as a common villager but greatly gifted in magic, a novice of the magical order of the Knights of the Rose.\nThe Knights and their sister order, the Ladies of the Isle, defend a great secret: the means and location of the Serpent's imprisonment a thousand years ago by the Young God in whose name their order was founded.\nQuitaine is under subtle attack by the King of Lys, who has secretly become an adept of the hidden order of the Serpent, and he will let nothing and no one stand in the way of his quest to discover how to free his God. But the Knights of the Rose, and the Ladies of the Isle believe that if the Serpent is freed, the world will be enslaved to chaos: humanity will destroy itself, and all that man has made will be corrupted.\nThe War of the Rose and Serpent has begun again, after a thousand years.", "author": "Kathleen Bryan"}, {"title": "The Slaughtered Virgin of Zenopolis (Inspector Capstan #1)", "isbn": "", "averageRating": "3.49", "description": "BATHS, BANKS AND ROMAN INSURRECTION\nDetective Inspector Capstan investigates a murder at Bath's almost famous Basin Museum, a hapless armed robbery, the theft of ancient Roman weaponry and the answer to \"one across\" in the local newspaper. Meanwhile, the city is under threat of Roman invasion and their leader, Becky Philips, is taking no prisoners.", "author": "David  Blake"}, {"title": "The Storyteller", "isbn": "1419700472", "averageRating": "4.10", "description": "A good girl.\nA bad boy.\nA fairy tale that's true.\nA truth that is no fairy tale.\nIt begins the day Anna finds the child's doll on the floor of the student lounge. When it's claimed by Abel, the school drug dealer, Anna becomes determined to learn more about this mysterious boy with the military haircut and deep blue eyes. She follows him after school and discovers a secret: Abel is caring for his six-year-old sister, Micha, alone. Anna listens in as he tells her a fairy tale, the story of a little orphan queen pursued by hunters across the oceans for the treasure she carries: her pure, diamond heart.\nIt's a story with parallels to reality. Social services and Micha's abusive father could take her from Abel if they discover the truth.\nDespite friend's warnings, Anna is drawn to Abel and Micha, and falls under the spell of the story of the little queen and her desperate voyage.\nBut when people Abel has woven into his tale turns up dead, it's Anna whose heart is in danger. Is she in love with a killer? And has she set out on a journey from which there is no return?", "author": "Antonia Michaelis"}, {"title": "The Switchblade Mamma", "isbn": "", "averageRating": "4.12", "description": "Lillian Ann Cross is forced to live the worst nightmare of her life. She is an everyday middle class American, striving to survive in an everyday changing world. Her life was abruptly\nturned upsidedown forever as she was kidnapped and forced into a world called \"Hen Fighting.\"\nA world in which women fight and bets are made upon their bloodshed.Lillian is forced to comply due to the threats made upon her mother's life. Being a loving person her whole life, Lillian finds difficulty grasping her new functions. As she is conditioned to live in her new world, she is subjected to an experimental procedure. A procedure which has taken the lives of a few before her. As she survives, she now has to learn how to live with her new \"implants.\" Implants which strengthen her bones, giving her strength and an upper ability amongst others. Implants which require weekly sustenance, or she will die.", "author": "Lindsey Schussman"}, {"title": "The Thing: Idol of Millions", "isbn": "0785118136", "averageRating": "3.80", "description": "Join Ben Grimm and his pals as they clobber their way through the Marvel Universe! Spinning out of events from 'Fantastic Four', the idol of millions is now worth billions - but will big bucks make a Rockefeller out of this rocky fella?", "author": "Dan Slott"}, {"title": "The Ticket", "isbn": "1941103863", "averageRating": "3.82", "description": "Librarian Note: See Alternate Cover Edition \u0001.\nTray Dunaway longs to be part of the popular set at school but she's growing too fast and her clothes no longer fit. The only person who understands Tray's need for acceptance is her grandmother, but when Tray wears Gram's hand-sewn clothes to school, the kids make fun of her tall, boney appearance. Tray's luck improves when Pee Wee Johnson, a down-and-out friend of her father's, buys two lottery tickets and gives one to Mr. Dunaway as a thank-you for driving him to Hazard, Illinois. When her father's ticket turns out to be the winner, Johnson demands his cut of the proceeds but Tray's dad refuses. What seems like a stroke of good fortune suddenly becomes a disturbing turn of events as Johnson threatens to cause problems for the family and Tray.", "author": "Debra Coleman Jeter"}, {"title": "The Time Of Light", "isbn": "0747553726", "averageRating": "4.11", "description": "Markus, a former German soldier devastated by the outbreak of this new war, seeks atonement from an Armenian priest for his part in the Nazi invasion of Russia. Framed by the 9-day Nagorno-Karabakh conflict of 1994, this book contains a story weaved from historical narration and tales - tales of war and tales of women - as two men talk.", "author": "Gunnar Kopperud"}, {"title": "The Táin", "isbn": "0670018686", "averageRating": "3.97", "description": "\"[A] brilliant and altogether engaging new translation\" (Los Angeles Times) of the greatest epic in Irish literature\nDating from the eighth century, The Tin is the oldest Irish epic, a mythic tale on par with Beowulf and The Aeneid. Following legendary warrior C Chulainn into his battle against the invading army of Connacht, The Tin is the story of the emergence of a hero, a paean to the Irish landscape, and a bawdy and contentious marital farce. In its first translation in forty years, Ciaran Carson brings this seminal work of Irish literature fully to life, capturing all of its visceral power in what acclaimed poets Seamus Heaney and Paul Muldoon individually called one of the best books of the year.", "author": "Anonymous"}, {"title": "The Unschooled Wizard (Sun Wolf and Starhawk, #1-2)", "isbn": "", "averageRating": "4.03", "description": "Omnibus book club edition containing the Ladies of Madrigyn and the Witches of Wenshar.", "author": "Barbara Hambly"}, {"title": "The White Giraffe", "isbn": "", "averageRating": "3.99", "description": "PA thrilling adventure classic-inthe- making!P The night Martine Allen turns eleven years old is the night her life changes completely. Martine's parents are killed in a fire, so she must leave her home to live on an African wildlife reserve with a grandmother she never even knew she had. When Martine arrives, she hears tales of a mythical animal living there ,a white giraffe. They say no one has ever seen the animal, but it does leave behind footprints. Her grandmother insists that the white giraffe is just a legend, but then one stormy night, Martine looks out her bedroom window straight into the eyes of the tall silvery animal. Could it be just Martine's imagination, or is the white giraffe real? And if so, why is everyone keeping its existence a secret?", "author": "Lauren St. John"}, {"title": "The Zephyrs of Najd: The Poetics of Nostalgia in The Classical Arabic Nasib", "isbn": "0226773361", "averageRating": "4.50", "description": "Arabs have traditionally considered classical Arabic poetry, together with the Qur'an, as one of their supreme cultural accomplishments. Taking a comparatist approach, Jaroslav Stetkevych attempts in this book to integrate the classical Arabic lyric into an enlarged understanding of lyric poetry as a genre.\nStetkevych concentrates on the \"places of lost bliss\" that furnish the dominant motif in the lyric-elegiac opening section (nasib) of the classic Arab code, or qusidah. In defining the Arabic lyrical genre, he shows how pre-Islamic lamentations over abandoned campsites evolved, in Arabo-Islamic mystical poetry, into expressions of spiritual nostalgia. Stetkevych also draws intriguing parallels between the highlands of Najd in Arabic poetry and Arcadia in the European tradition. He concludes by exploring the degree to which the pastoral-paradisiacal archetype of the nasibpervades Arabic literary perception, from the pre-Islamic ode through the Thousand and One Nightsand later texts.\nEnhanced by Stetkevych's sensitive translations of all the Arabic texts discussed, The Zephyrs of Najdbrings the classical Arabic ode fully into the purview of contemporary literary and critical discourse.", "author": "Jaroslav Stetkevych"}, {"title": "The tale of Jemima puddle-duck", "isbn": "", "averageRating": "4.04", "description": "Searching for a convenient nesting place, befuddled Jemima Puddle-Duck chooses a fox's den and is then rescued by barnyard collie and pups from the fox's cooking pot.", "author": "Beatrix Potter"}, {"title": "Three Poems: Host and Guest / Aluda Ketelauri / The Snake-Eater", "isbn": "", "averageRating": "4.70", "description": "Vazha Pshavela (1861-1915) is considered one of the great poets in the fifteen-centuried Georgian literature. The three poems represented in the book are the most distinguished works of the poet.", "author": "Vazha-Pshavela"}, {"title": "To Shield the Queen (Ursula Blanchard, #1)", "isbn": "0671015311", "averageRating": "3.72", "description": "In this compelling debut of her historical mystery series, Fiona Buckley introduces Ursula Blanchard, a widowed young mother who has become lady-in-waiting to Queen Elizabeth I. Armed with a sharp eye, dangerous curiosity, and uncanny intelligence, Ursula pledges...\nTo Shield the Queen\nRumor has linked Queen Elizabeth I to her master of horse, Robin Dudley. As gossip would have it, only his ailing wife, Amy, prevents marriage between Dudley and the Queen. To quell the idle tongues at court, the Queen dispatches Ursula Blanchard to tend to the sick woman's needs. But not even Ursula can prevent the \"accident\" that takes Amy's life. Did she fall or was she pushed? Was Ursula a pawn of Dudley and the Queen?\nSuddenly Ursula finds herself at the center of the scandal, trying to protect Elizabeth as she loses her heart to a Frenchman who may be flirting with sedition against her Queen. She can trust no one, neither her lover nor her monarch, as she sets out to find the truth in a glittering court that conceals a wellspring of blood and lies.", "author": "Fiona Buckley"}, {"title": "Transmetropolitan, Vol. 4: The New Scum", "isbn": "", "averageRating": "4.41", "description": "Investigative reporter Spider Jerusalem attacks the injustices of the 23rd Century surroundings while working for the newspaper The Word in this critically-acclaimed graphic novel series written by comics superstar Warren Ellis, the co-creator of PLANETARY and THE AUTHORITY.", "author": "Warren Ellis"}, {"title": "Triptych (Will Trent, #1)", "isbn": "", "averageRating": "4.14", "description": "In the city of Atlanta, women are dying--at the hands of a killer who signs his work with a single, chilling act of mutilation. Leaving behind enough evidence to fuel a frenzied police hunt, this cunning madman is bringing together dozens of lives, crossing the boundaries of wealth and race. And the people who are chasing him must cross those boundaries too. Among them is Michael Ormewood, a veteran detective whose marriage is hanging by a thread--and whose arrogance and explosive temper are threatening his career. And Angie Polaski, a beautiful vice cop who was once Michael's lover before she became his enemy.\nBut another player has entered the game: a loser ex-con who has stumbled upon the killer's trail in the most coincidental of ways--someone who may be the key to breaking the case wide open...", "author": "Karin Slaughter"}, {"title": "Twelfth Grade Kills (The Chronicles of Vladimir Tod, #5)", "isbn": "", "averageRating": "4.35", "description": "It all comes down to this.\nVlad's running out of time. The Elysian Council has given him weeks to live, and that's if the Slayer Society doesn't kill him - along with all the citizens of Bathory - first. Then there's the issue of Vlad's father, who may or may not still be alive after all these years, and oh yeah, that tiny little detail in the Pravus prophecy about Vlad enslaving Vampirekind and the human race. So much for college applications.\nIn this epic finale to Heather Brewer's heart-stopping Chronicles of Vladimir Tod, dark secrets will be revealed, old friends will become enemies, and warm blood will run cold. Just be careful it isn't yours.", "author": "Heather Brewer"}, {"title": "Very Bad Things (Briarwood Academy, #1)", "isbn": "", "averageRating": "3.95", "description": "This is an alternate cover edition for \u0001.\nBorn into a life of privilege and secrets, Nora Blakely has everything any nineteen-year-old girl could desire. She's an accomplished pianist, a Texas beauty queen, and on her way to Princeton after high school. She's perfect...\nLeaving behind her million-dollar mansion and Jimmy Choos, she becomes a girl hell-bent on pushing the limits with alcohol, drugs, and meaningless sex.\nThen she meets her soulmate. But he doesn't want her.\nWhen it comes to girls, twenty-five-year-old Leo Tate has one rule: never fall in love. His gym and his brother are all he cares about...until he meets Nora. He resists the pull of their attraction, hung up on their six year age difference.\nAs they struggle to stay away from each other, secrets will be revealed, tempers will flare, and hearts will be broken.\nWelcome to Briarcrest Academy...where sometimes, the best things in life are Very Bad Things.", "author": "Ilsa Madden-Mills"}, {"title": "Vision of Sir Launfal and Other Poems", "isbn": "", "averageRating": "3.83", "description": "Number 30 in a series of literary pamphlets published monthly and available at the price of 15 cents per copy, or a yearly subscription (19 numbers) for $1.25", "author": "James Russell Lowell"}, {"title": "Volition (The Perception Trilogy, #2)", "isbn": "", "averageRating": "3.90", "description": "Zoe Vanderveen is on the run with her captor turned rescuer, Noah Brody.\nThey're in love.\nOr at least that's what he tells her. Her memories have returned but her feelings are dreamlike--thin and fleeting. Her heart can't be trusted. Just look at what happened with Taylor Blake.\nSenator Vanderveen's new team of cyborg agents are in hot pursuit, and a reward for their capture is broadcast nationwide. Record breaking cold and snow hinder their escape. Someone dies helping them.\nAnd their fight for survival has only begun.", "author": "Lee Strauss"}, {"title": "What Do You Do?", "isbn": "1416904999", "averageRating": "3.57", "description": "WHAT DO YOU DO?\nA hen lays eggs...\nA cow gives milk...\nAn elephant squirts water...\nBut what does a beetle do?", "author": "Mandy Stanley"}, {"title": "What the Dormouse Said: Lessons for Grownups from Children's Books", "isbn": "1565122410", "averageRating": "3.80", "description": "This one-of-a-kind collection reminds weary adults not to lose sight of the values and virtues they learned as kids. Here are over three hundred quotations from over two hundred well-loved children's books, such as Charlotte's Web, Peter Pan, Harry Potter and the Sorcerer's Stone, Eloise, Sounder, Number the Stars, and Goodnight Moon, organized by topic, among them Acceptance, Goodness, Family Woes, and Growing Old. On Silence: \"I assure you that you can pick up more information when you are listening than when you are talking.\"--E. B.White, The Trumpet of the Swan. On Reverence: \"Dying's part of the wheel, right there next to being born. . . . Being part of the whole thing, that's the blessing.\"--Natalie Babbitt, Tuck Everlasting.\nWith clever illustrations from Pierre Le-Tan, here is a book to share with a friend or keep by your own bedside. It's the perfect gift for your sister, your mother, your brother, your nephew, your kid's teacher, your daughter away at college, your son in the Navy, your mailman, your priest, for the old lady next door, or for the baby just born. Most importantly, give it to yourself. It will help you remember why you loved reading in the first place.", "author": "Amy Gash"}, {"title": "Where the World Begins", "isbn": "", "averageRating": "5.00", "description": "Inspired by stories the author's aunts and mother told her about growing up in a poor sharecropper's family in Louisiana.\n\"These poems do not simply tell the most important stories--they sing those stories. . . . The songs are grief-stricken, as many of the old songs are, but they know how to recognize love in the rough touch of a mother's hands tugging a comb through the knots. They know what belonging is, they can hear that 'Every stone says he has to stay here,' where the 'he' in the poem is all of us and the 'here' is the home we are all searching for.\" --Susanna Lang, author of Even Now and Tracing the Lines\n\"Pat Daneman is a woman on fire. She has a story to tell in Where the World Begins, of hardscrabble survival on the land. Her images burn alive, long after I put down the book. I recommend this unforgettable experience to you.\" --Denise Low, 2007-2009 Kansas Poet Laureate", "author": "Pat Daneman"}, {"title": "Will to Murder: The True Story Behind the Crimes & Trials Surrounding the Glensheen Killings", "isbn": "188731721X", "averageRating": "3.74", "description": "Finally, the true story of the Glensheen killings--the murder of elderly Duluth heiress Elisabeth Congdon and her nurse--as told through the eyes of former Duluth detective Gary Waller and St. Louis County prosecutor John DeSanto. This team led the case's investigation and successful prosecution of Roger Caldwell, Congdon's son-in-law, in the most notorious double murder in Minnesota history. The authors frankly discuss their successes and failures to explain how the man they convicted of murder, Roger Caldwell, was later set free--after confessing to the crimes! They also follow Marjorie Congdon Caldwell; Elisabeth's notorious adopted daughter, over her arrests and convictions for a string of arsons and present evidence that suggests she may have gotten away with murder--four times.", "author": "Gail Feichtinger"}, {"title": "Wolf Pact, Part I (Wolf Pact, #1)", "isbn": "0748119884", "averageRating": "3.91", "description": "The ancient wolves were once proud guardians of time. Now they are enslaved in the underworld, mere extensions of Lucifer's will. Lawson's pack managed to escape this fate by fleeing aboveground. But when the hounds capture the girl Lawson loves, he will risk everything -- including his own brothers' freedom -- to win her back. Meanwhile, Bliss Llewellyn is adjusting to humanity after giving up her immortal vampire life. When her Aunt Jane is kidnapped by the Hounds of Hell, Bliss vows to do whatever it takes to save her -- even if it means joining forces with the dangerously good-looking boy with a wolf's soul and a too-intimate knowledge of Jane's captors.", "author": "Melissa de la Cruz"}, {"title": "Wycliffe and the Cycle of Death", "isbn": "0752844458", "averageRating": "3.61", "description": "A respectable bookseller is found bludgeoned and strangled and it's up to Chief Superintendent Wycliffe to find out why . . .\nWhen Matthew Glynn is murdered, Wycliffe is mystified. Why would anyone want to kill him? But a look at Glynn's background reveals tension within the family. Alfred Glynn, an eccentric recluse, has born a grudge against his brother for years. The other brother, Maurice, argued bitterly with Matthew over the sale of family land. His sister Sara is caught out in several crucial lies to the police. Add to this a discontented son, the discovery of valuable documents in the bookseller's safe, and the mysterious, still unexplained disappearance of Matthew's wife years earlier, and Wycliffe faces one of his most impenetrable cases yet.\nAnd then another Glynn dies . . .", "author": "W.J. Burley"}, {"title": "what it means to be avant-garde", "isbn": "0811212386", "averageRating": "4.47", "description": "what it means to be avant-garde is David Antin's third collection of \"talk poems\" published by New Directions. As in his earlier talking at the boundaries (1976), and tuning (winner of the 1984 PEN/Los Angeles Literary Award for Poetry), Antin's brilliant improvised disquisitions at once challenge readers' expectations even as they instruct and entertain. A poet, performance artist, art critic, and professor of visual arts, Antin, since his college days in New York in the '50s, has been at the cutting edge of the avant-garde. The avant-garde? Yes, if by this is meant not an image of fashion but the place where art and life intersect, imparting to both a greater urgency - if is meant the place where experience and knowledge find their deepest expression, where the idea of a universal language can find shape, where the price of art is itself, where the fringe is the very center of existence.", "author": "David Antin"}]
